{"review_id": "en_0054566", "product_id": "product_en_0655650", "reviewer_id": "reviewer_en_0263699", "stars": "4", "review_body": "Small issue, addressed quickly", "review_title": "Useful", "language": "en", "product_category": "wireless"}
{"review_id": "en_0596324", "product_id": "product_en_0607139", "reviewer_id": "reviewer_en_0300343", "stars": "4", "review_body": "I bought/wear this only as a slip, it is very see through other wise. Its been great for the slip function, but it is certainly no spanx either. I hate feeling squeezed in with spanx so it makes me happy, just don't expect spanx control from this product. I like the smoothness of the material, but it does grab fabrics. If it gives me too much trouble, I rub it with a dryer sheet and it helps counter the cling (and smells great, ha!). That said I do have a pet peeve for clothes I have to make adjustments to wear (ie rubbing down with a dryer sheet), so its not as grab and go I as would like it to be.", "review_title": "A decent slip", "language": "en", "product_category": "apparel"}
{"review_id": "en_0493328", "product_id": "product_en_0940244", "reviewer_id": "reviewer_en_0820338", "stars": "4", "review_body": "The car is awesome, but the packaging for mailing was not so great. The car broke loose in the box, if it wasn't loose already and the driver's side mirror was broken off. Very disappointed since I paid $25 for it.", "review_title": "Custom Shelby", "language": "en", "product_category": "toy"}
{"review_id": "en_0108322", "product_id": "product_en_0827465", "reviewer_id": "reviewer_en_0514352", "stars": "4", "review_body": "We have had them for 2 days and have not even washed them yet! Bought them for our camping trailer and will use them soon.", "review_title": "We have had them for 2 days and have not ...", "language": "en", "product_category": "kitchen"}
{"review_id": "en_0702769", "product_id": "product_en_0839698", "reviewer_id": "reviewer_en_0713363", "stars": "4", "review_body": "It took me quite a while to finish this book but so glad to have wadded through to the end. A must read for all. But way thick in the weeds.", "review_title": "Great read, yet way deep in the weeds", "language": "en", "product_category": "digital_ebook_purchase"}
{"review_id": "en_0381216", "product_id": "product_en_0794018", "reviewer_id": "reviewer_en_0589216", "stars": "4", "review_body": "The ultimate solution for running, training with gears on. Just brilliant i was looking for something like this for years. Thanks", "review_title": "Just brilliant", "language": "en", "product_category": "wireless"}
{"review_id": "en_0509449", "product_id": "product_en_0731519", "reviewer_id": "reviewer_en_0588408", "stars": "4", "review_body": "I read others reviews before posting and decided to take my chances. I was pleasantly surprised! The candies were misshapen and had to get out of the wrappers, but since they’re just for me, I don’t care. They’re not stale and chewy; they seem to be fresh minus the obvious one time melt they must have gone through. You get about a ziplock sandwich bag size full of jolly ranchers.", "review_title": "Not as bad as others said", "language": "en", "product_category": "grocery"}
{"review_id": "en_0425201", "product_id": "product_en_0544365", "reviewer_id": "reviewer_en_0561638", "stars": "4", "review_body": "Great price - delivery was so slow that I forgot I ordered them so it was a nice surprise to see them sitting on my porch.", "review_title": "Great price - delivery was so slow that I forgot ...", "language": "en", "product_category": "grocery"}
{"review_id": "en_0810546", "product_id": "product_en_0491065", "reviewer_id": "reviewer_en_0532547", "stars": "4", "review_body": "We needed a small dresser for a shared bedroom in a camper and this was perfect. Fit perfectly into the space that we needed and looks nice as well. It's not the highest quality piece, but it's sturdy enough for what we need it for and the drawers offer enough room for my daughters items.", "review_title": "Nice little dresser", "language": "en", "product_category": "home"}
{"review_id": "en_0274504", "product_id": "product_en_0353321", "reviewer_id": "reviewer_en_0313930", "stars": "4", "review_body": "If I take the time to write a review, then you should pay for my prime membership.", "review_title": "Review", "language": "en", "product_category": "book"}
{"review_id": "en_0415859", "product_id": "product_en_0139561", "reviewer_id": "reviewer_en_0501698", "stars": "4", "review_body": "I liked the style of these from the pictures because they looked a little more business professional compared to what I already own. Once I got them I didn't really like how they look on my face, but they work and the polarized lenses are decent. I look like a blind person wearing them but everyone needs a pair of throw-around glasses so these are it for me.", "review_title": "Functional but I look like a blind person wearing them", "language": "en", "product_category": "other"}
{"review_id": "en_0500432", "product_id": "product_en_0699706", "reviewer_id": "reviewer_en_0292702", "stars": "4", "review_body": "These are my first bluetooth headphones. My previous wired headphones all got retired due to the wear and tear for the wires. I feel this bluetooth headphones are more convenient than the wired headphones. The voice quality is excellent for both inbound and outbound, no difference from any wired headphones. With the much shorter wires, I foresee I could use them longer than my previous headphones.", "review_title": "Neat wires and good voice quality", "language": "en", "product_category": "electronics"}
{"review_id": "en_0177645", "product_id": "product_en_0909552", "reviewer_id": "reviewer_en_0360836", "stars": "4", "review_body": "It does help that is for sure", "review_title": "Good", "language": "en", "product_category": "drugstore"}
{"review_id": "en_0776860", "product_id": "product_en_0612922", "reviewer_id": "reviewer_en_0770970", "stars": "4", "review_body": "This was a very enjoyable read for me as a kid growing up watching the classics. Although there were some parts of the movie i didn't enjoy, my overall opinion of this movie is still high.", "review_title": "Great Movie", "language": "en", "product_category": "digital_video_download"}
{"review_id": "en_0075031", "product_id": "product_en_0294526", "reviewer_id": "reviewer_en_0919501", "stars": "4", "review_body": "Does not wick well, but it helps my thigh strain. would buy again.", "review_title": "exact fit same specs as original. like the velcro closure to size it right.", "language": "en", "product_category": "drugstore"}
{"review_id": "en_0076555", "product_id": "product_en_0726017", "reviewer_id": "reviewer_en_0617552", "stars": "4", "review_body": "The hair is beautiful, my birthday present to myself", "review_title": "Four Stars", "language": "en", "product_category": "beauty"}
{"review_id": "en_0525160", "product_id": "product_en_0633311", "reviewer_id": "reviewer_en_0961984", "stars": "4", "review_body": "I like them a lot the only thing is I have small hands so some of the fingers are a little big", "review_title": "They’re good quality!", "language": "en", "product_category": "automotive"}
{"review_id": "en_0595972", "product_id": "product_en_0903018", "reviewer_id": "reviewer_en_0945859", "stars": "4", "review_body": "It's what I expected, lots of practice drills. For a beginner, some of the drills are more than I can handle now but it helps me to have a more focused practice session.", "review_title": "It's what I expected, lots of practice drills. ...", "language": "en", "product_category": "book"}
{"review_id": "en_0969275", "product_id": "product_en_0112541", "reviewer_id": "reviewer_en_0437806", "stars": "4", "review_body": "These are amazing and I love them. They are great for transferring shampoo from one container to another.", "review_title": "Four Stars", "language": "en", "product_category": "kitchen"}
{"review_id": "en_0939198", "product_id": "product_en_0539612", "reviewer_id": "reviewer_en_0533181", "stars": "4", "review_body": "Does not track blood pressure", "review_title": "Four Stars", "language": "en", "product_category": "home"}
{"review_id": "en_0698967", "product_id": "product_en_0638356", "reviewer_id": "reviewer_en_0891957", "stars": "4", "review_body": "Lots of information that you can pull with this reader. Pretty happy with it", "review_title": "Pretty happy with", "language": "en", "product_category": "automotive"}
{"review_id": "en_0599156", "product_id": "product_en_0041033", "reviewer_id": "reviewer_en_0678187", "stars": "4", "review_body": "Plays really good Thanks ☺", "review_title": "Four Stars", "language": "en", "product_category": "other"}
{"review_id": "en_0651497", "product_id": "product_en_0445194", "reviewer_id": "reviewer_en_0075243", "stars": "4", "review_body": "My gf loved them while I gifted yes her first set of dice. Affordable and a great look.", "review_title": "Affordable", "language": "en", "product_category": "toy"}
{"review_id": "en_0687351", "product_id": "product_en_0293555", "reviewer_id": "reviewer_en_0021068", "stars": "4", "review_body": "They work great. No way to change volume except with a Bluetooth device.", "review_title": "They work great. No way to change volume except with a ...", "language": "en", "product_category": "electronics"}
{"review_id": "en_0930586", "product_id": "product_en_0035375", "reviewer_id": "reviewer_en_0687720", "stars": "4", "review_body": "great tool but if you are not careful it will bind and jerk . Probably just my inability to keep it level.", "review_title": "great tool but if you are not careful it will ...", "language": "en", "product_category": "other"}
{"review_id": "en_0476877", "product_id": "product_en_0932417", "reviewer_id": "reviewer_en_0471609", "stars": "4", "review_body": "I loved the price, for $45 when on sale I was able to get a reliable and easy to use wireless router. I told spectrum to kick rocks. Setup is easy and a person who understands little can do it. I have noticed a significant improvement of coverage and speed throughout my home. My house is 2200 square feet and it works well throughout.", "review_title": "Great router for a family with on a budget", "language": "en", "product_category": "pc"}
{"review_id": "en_0280635", "product_id": "product_en_0142482", "reviewer_id": "reviewer_en_0313606", "stars": "4", "review_body": "These gift boxes were so cute! Very good quality. My only complaint is that it did not come with directions on how to fold them properly. I eventually figured it out but took me a few tries.", "review_title": "Great quality", "language": "en", "product_category": "drugstore"}
{"review_id": "en_0802551", "product_id": "product_en_0384349", "reviewer_id": "reviewer_en_0875986", "stars": "4", "review_body": "It works well without any setup, just plug and play. The only thing I don't like, at least with my laptop, is that it makes the laptop screen black when I cast to the tv. I can still use the touchpad or even the touch screen on my laptop, but can only see the screen on the tv. I'm not sure if this is a setting that can be changed on my laptop, but when I used to cast from my laptop to a roku, I was able to see the screen on both the laptop and tv.", "review_title": "The only thing I don't like, at least with my laptop", "language": "en", "product_category": "electronics"}
{"review_id": "en_0269139", "product_id": "product_en_0798780", "reviewer_id": "reviewer_en_0535842", "stars": "4", "review_body": "Pay attention to the narrator at the beginning of the film. She says some disturbing things. It was pretty impactful for me. A little scary. This is a good movie. Watch it. It's very different", "review_title": "This is a very interesting movie. It's about time travel and what you do with it.", "language": "en", "product_category": "digital_video_download"}
{"review_id": "en_0772900", "product_id": "product_en_0510899", "reviewer_id": "reviewer_en_0730582", "stars": "4", "review_body": "I Really like it, but it’s not quite a love story; it’s very powerful, for something so small, and lightweight. However, the combination of how/where the hose exits the canister, and the size and number of wheels on the bottom, lead to a continual nuisance of tipping over. The plastic lever for switching out attachments is very cheap plastic, and broke as I was unpacking the vacuum. This may be a huge issue for some, but I don’t ever use attachments, so for me, no harm, no foul. The location of the power switch is a bit problematic as well, considering the other switch located in the mirror position on the back of the canister, causes the cord to retract. I’ve done this no less than 500 times. And no, for clarity, I am not a slow learner. That said, I do in fact, love that the vacuum has a retractable cord. I realize it is trivial, but for me, the winding and wrapping of a loose cord is just irritating. Not difficult, irritating. So the fact I don’t have to wind and wrap and wind and wrap, I’ll give it a star back, for the convenience it provides. Overall though, the pros far outweigh the cons.", "review_title": "Almost a match made in heaven", "language": "en", "product_category": "home"}
{"review_id": "en_0587000", "product_id": "product_en_0502576", "reviewer_id": "reviewer_en_0205681", "stars": "4", "review_body": "After a few weeks, the right side stopped working on the first pair I purchased. Anker's customer support is very good though, replacement was sent to me quickly and haven't had any issues with the 2nd pair. I like that it comes with 4 different sizes of the piece that goes in your ear, and the part that you plug in is slightly less bulky than other similar headphones I've tried. They stay pretty comfortable even when wearing them for long periods of time, and the sound quality is as good as I'd expect for a $40 pair. I'll give this 5 stars if this second pair is still working in 6 months with no problems.", "review_title": "Pretty good for the price", "language": "en", "product_category": "wireless"}
{"review_id": "en_0186152", "product_id": "product_en_0928756", "reviewer_id": "reviewer_en_0405675", "stars": "4", "review_body": "Very soft & easy to use. My belly isn't very large yet & this sits more on the lower stomach than under it. I think this product would be best when you're further along & your stomach is larger.", "review_title": "Very soft & easy to use", "language": "en", "product_category": "drugstore"}
{"review_id": "en_0631636", "product_id": "product_en_0341143", "reviewer_id": "reviewer_en_0337567", "stars": "4", "review_body": "Bought 3 items 2 for Christmas gift, my wife loves hers.", "review_title": "Quick service had a little mix up with how many was sent but return went ok.", "language": "en", "product_category": "home"}
{"review_id": "en_0789924", "product_id": "product_en_0443869", "reviewer_id": "reviewer_en_0079559", "stars": "4", "review_body": "There really nice looking in my cartilage piercing. The only complaint I have about them is the diamonds really hard to screw in with big fingers.", "review_title": "There really nice looking in my cartilage piercing", "language": "en", "product_category": "jewelry"}
{"review_id": "en_0475914", "product_id": "product_en_0259429", "reviewer_id": "reviewer_en_0408302", "stars": "4", "review_body": "Got computer today. i7, 32g ram 1t ssd... Very nice. Very fast. It feels solid though maybe a bit heavier than I thought it would be. Powered up and connected to internet quickly. Installed chrome browser and chrome would hang after a reboot until I guess McAfee did it's scanning... Uninstalled McAfee and then that went away. Other than that this is a great machine... I will revise this review after I get a bit more time with it!", "review_title": "Fast and solid though I did have to remove McAfee", "language": "en", "product_category": "pc"}
{"review_id": "en_0917736", "product_id": "product_en_0027181", "reviewer_id": "reviewer_en_0672395", "stars": "4", "review_body": "This battery was for a cordless phone we have had for years. It fit and worked perfectly.", "review_title": "Replacement battery for cordless phone", "language": "en", "product_category": "office_product"}
{"review_id": "en_0202708", "product_id": "product_en_0184477", "reviewer_id": "reviewer_en_0428762", "stars": "4", "review_body": "These are smaller than i expected.", "review_title": "Just ok", "language": "en", "product_category": "book"}
{"review_id": "en_0858048", "product_id": "product_en_0061384", "reviewer_id": "reviewer_en_0193716", "stars": "4", "review_body": "O have not been able to switch from Fahrenheit to Celsius yet. I would appreciate more details on how to do it.", "review_title": "Need help", "language": "en", "product_category": "drugstore"}
{"review_id": "en_0808894", "product_id": "product_en_0192651", "reviewer_id": "reviewer_en_0489509", "stars": "4", "review_body": "My friend just got s9 and what could be the better gift than this? The case was good leather touch and feel to it. Comes with a wristlet and credit card slots and 1 ID slot. I put on her phone which was easy to do so without any hassle. It also has a good value to it, my friend liked it.", "review_title": "Perfect gift", "language": "en", "product_category": "wireless"}
{"review_id": "en_0349776", "product_id": "product_en_0624888", "reviewer_id": "reviewer_en_0885659", "stars": "4", "review_body": "I got tired of my favorite shaving soap being out of stock and decided to make my own. I originally tried the clear soap like this from the same manufacturer and added my own raw shea butter, but it came out to waxy. The amount of shea butter in this is perfect. I add in tea tree oil and melt it in the microwave in my shave soap container. Works as well as the name brand stuff I use to buy, but at a fraction of the price. Just make sure you have a good badger hair brush to use with this. If you don't have a shaving soap container, you can use a small tupperware container with a lid. I use a Proraso shaving soap container from a previous purchase. It's all plastic and works great.", "review_title": "Works great for shaving soap", "language": "en", "product_category": "home"}
{"review_id": "en_0446050", "product_id": "product_en_0944446", "reviewer_id": "reviewer_en_0514835", "stars": "4", "review_body": "Arrived on time and in perfect condition! Very PRETTY!", "review_title": "LOVE THESE!", "language": "en", "product_category": "home"}
{"review_id": "en_0426484", "product_id": "product_en_0057994", "reviewer_id": "reviewer_en_0216033", "stars": "4", "review_body": "I really like that fact that these are semi-insulated pull on shoe/boots. I've worn them out in the snow a few times and they seem to be reasonably waterproof as well. Easy to get on and off. The only \"negative\" was the insoles and the absence of any arch or even cushion. But based on the wonderful value, I picked up a pair of gel insoles for under $9 and now these boots are quite comfortable to wear and serve a great purpose.", "review_title": "Nice, lightweight winter snow shoe", "language": "en", "product_category": "shoes"}
{"review_id": "en_0144222", "product_id": "product_en_0430228", "reviewer_id": "reviewer_en_0121143", "stars": "4", "review_body": "only thing I dont like is it makes a small noise when in use. otherwise its all good.", "review_title": "small clunk", "language": "en", "product_category": "drugstore"}
{"review_id": "en_0486486", "product_id": "product_en_0647275", "reviewer_id": "reviewer_en_0708887", "stars": "4", "review_body": "I got the glitter mermaid cake topper for my daughters birthday next month. The colors are bright and beautiful and there is just the right amount of glitter. It does seem a little high for the materials used but worth it if your child loves mermaids as much as mine.", "review_title": "Bold, bright and beautiful", "language": "en", "product_category": "toy"}
{"review_id": "en_0148023", "product_id": "product_en_0157847", "reviewer_id": "reviewer_en_0737122", "stars": "4", "review_body": "This story is awfully familiar; I may have bought it before, under a different title or author name?' Anyway, it was good. It was short. Nice characters. Not that much emotion but I can make up for that in my mind. I couldn't see any obvious editorial mistakes. The dialogue read as natural, not stilted. It was a good idea having a character who can see real magical creatures under their human disguises and I guess having him shut away in a facility because of it, is a natural story progression. The elf was fun..", "review_title": "Familiar", "language": "en", "product_category": "digital_ebook_purchase"}
{"review_id": "en_0732554", "product_id": "product_en_0558509", "reviewer_id": "reviewer_en_0322265", "stars": "4", "review_body": "Easy to use. Saw much inprovement within days!", "review_title": "Wonderful!", "language": "en", "product_category": "beauty"}
{"review_id": "en_0588434", "product_id": "product_en_0238619", "reviewer_id": "reviewer_en_0095246", "stars": "4", "review_body": "These do a great job of keeping drinks cold. They are attractive and fit nicely in even a smaller hand. The only reason I'm giving them four stars is that they have to be hand washed and I prefer to throw everything in the dishwasher.", "review_title": "Do the job", "language": "en", "product_category": "kitchen"}
{"review_id": "en_0281980", "product_id": "product_en_0643050", "reviewer_id": "reviewer_en_0898046", "stars": "4", "review_body": "The sound quality the picture quality very very good. My only comment is that I can't pick up some of my local programming. But that's minor considering the Channel that I do have available on my satellite television.", "review_title": "What's important to know is that you're getting a quality television set for very little money.", "language": "en", "product_category": "other"}
{"review_id": "en_0967869", "product_id": "product_en_0029362", "reviewer_id": "reviewer_en_0701495", "stars": "4", "review_body": "Very good Spades Game", "review_title": "Very good Spades game.", "language": "en", "product_category": "other"}
{"review_id": "en_0592890", "product_id": "product_en_0839627", "reviewer_id": "reviewer_en_0258428", "stars": "4", "review_body": "I hurt my calf doing double unders during a workout. I think I may have had a tiny little tear. I bought this brace and wear it every day, regardless of the workout. Two weeks later I am able to do double unders with no pain. I am going to continue to wear this for a few more weeks and then always on days that require jumping. It is flexible, comfortable and adjustable. I have big old fat calf muscles...so I am always worried about things fitting. The only reason I didnt give it 5 stars is I was hoping it would be \"firmer\" or...more compression.", "review_title": "Comfortable and adjustable", "language": "en", "product_category": "sports"}
{"review_id": "en_0864785", "product_id": "product_en_0364787", "reviewer_id": "reviewer_en_0229601", "stars": "4", "review_body": "It’s look very nice but is very clumsy I don’t know how much protection will give your phone I don’t think much protection but it looks very good", "review_title": "It’s looks good but it’s kinda flimsy", "language": "en", "product_category": "wireless"}
{"review_id": "en_0858192", "product_id": "product_en_0572549", "reviewer_id": "reviewer_en_0608265", "stars": "4", "review_body": "But a satisfactory imitation. Once we received the missing, and later, replacements for the incorrectly-shipped parts, it was reasonably easy to put together. The screw heads do strip VERY easily, and you would be well-advised discard any that feel like they are starting to strip, because you will not get them secured. Also, be sure you have a short-handled screw driver for assembly.", "review_title": "Not the chair you remember from childhood...", "language": "en", "product_category": "home_improvement"}
{"review_id": "en_0023763", "product_id": "product_en_0306988", "reviewer_id": "reviewer_en_0289941", "stars": "4", "review_body": "Amazing laptop/pc desk... it is sturdy enough to keep a monitor and a laptop together at a same time.. assembly was relatively easy though it took a while.. material feels quite nice.. overall it is a great desk for student to organize stuff..", "review_title": "Amazing desk for student or anyone..", "language": "en", "product_category": "furniture"}
{"review_id": "en_0862220", "product_id": "product_en_0738811", "reviewer_id": "reviewer_en_0586815", "stars": "4", "review_body": "Liked the snowflake tin", "review_title": "It’s a gift card what else do you need to know?", "language": "en", "product_category": "other"}
{"review_id": "en_0559150", "product_id": "product_en_0777760", "reviewer_id": "reviewer_en_0778865", "stars": "4", "review_body": "My husband and I like the blanket. It is a quality product. We have the full size blanket. I am waking up feeling more rested. I wear an activity tracker and have noticed my restful sleep time has increased since I started using it.", "review_title": "Quality Product", "language": "en", "product_category": "home"}
{"review_id": "en_0416563", "product_id": "product_en_0629831", "reviewer_id": "reviewer_en_0666324", "stars": "4", "review_body": "Cameras work very well, but doesn’t have slot for card so you have to pay for cloud backup. Will replace, but not sellers fault. Will just use them for supplemental coverage", "review_title": "Nice cameras", "language": "en", "product_category": "camera"}
{"review_id": "en_0545448", "product_id": "product_en_0153310", "reviewer_id": "reviewer_en_0457051", "stars": "4", "review_body": "Beautiful. Would have given 5 stars if umbrella can be seen on both sides.", "review_title": "Umbrella colour one-sided", "language": "en", "product_category": "apparel"}
{"review_id": "en_0818946", "product_id": "product_en_0310468", "reviewer_id": "reviewer_en_0463681", "stars": "4", "review_body": "I am mostly satisfied. It was easy to assemble and the material is sturdy. I was initially disappointed because the package did not include the promised ribbons and adhesive for the ribbons. However, the seller reached out to me. She was willing to ship the ribbons to me, but I had already come up with a different idea. So she gave me a 25% refund. I would suggest this specific product over others due to its sturdiness and ease of assembly. But my advice is to order 2-3 weeks in advance so that if you need the ribbons and they're missing, you can tell the seller and have enough time for them to get shipped to you.", "review_title": "Good quality product but missing ribbons", "language": "en", "product_category": "home"}
{"review_id": "en_0220379", "product_id": "product_en_0835136", "reviewer_id": "reviewer_en_0791170", "stars": "4", "review_body": "Works very well and bright! The adhesive surface must be stronger!", "review_title": "Cool!", "language": "en", "product_category": "automotive"}
{"review_id": "en_0763642", "product_id": "product_en_0922128", "reviewer_id": "reviewer_en_0860157", "stars": "4", "review_body": "Love the look and simplicity of use, but my 1 year old has figured out how to pull it out of the outlet.", "review_title": "Looks nice, but...", "language": "en", "product_category": "baby_product"}
{"review_id": "en_0091611", "product_id": "product_en_0097981", "reviewer_id": "reviewer_en_0492470", "stars": "4", "review_body": "This works very well for the cost and the need. I did not provide 5 stars simply because the tool does get hot within 15 minutes.", "review_title": "Gets hot fast", "language": "en", "product_category": "pet_products"}
{"review_id": "en_0413565", "product_id": "product_en_0429131", "reviewer_id": "reviewer_en_0128583", "stars": "4", "review_body": "Weed eater works great, blower is good, both are light weight. I took off a star because I wish the blower blew a little harder.", "review_title": "Weed eater works great, blower is good", "language": "en", "product_category": "lawn_and_garden"}
{"review_id": "en_0387987", "product_id": "product_en_0887683", "reviewer_id": "reviewer_en_0963378", "stars": "4", "review_body": "I am unable to get any TV channels due to some 'location' error!!!", "review_title": "Four Stars", "language": "en", "product_category": "beauty"}
{"review_id": "en_0073209", "product_id": "product_en_0920575", "reviewer_id": "reviewer_en_0366305", "stars": "4", "review_body": "It was a pain in the tail to install in my 2013 Dodge Durango R/T but once I got them seated in correctly the light output looked great!", "review_title": "I see you!", "language": "en", "product_category": "automotive"}
{"review_id": "en_0471283", "product_id": "product_en_0051606", "reviewer_id": "reviewer_en_0918166", "stars": "4", "review_body": "Had a little trouble getting it to work. But, it seems fine now. I guess my grandson just needed to explore with it.", "review_title": "it seems fine now. I guess my grandson just needed to ...", "language": "en", "product_category": "video_games"}
{"review_id": "en_0896353", "product_id": "product_en_0151744", "reviewer_id": "reviewer_en_0874434", "stars": "4", "review_body": "Used this in my entryway above the coat rail and over a bench. My boyfriend loves that print so I added it to our home. The narrowness of the print made it perfect for the space.", "review_title": "Very bright, beautiful piece of decor", "language": "en", "product_category": "home"}
{"review_id": "en_0010879", "product_id": "product_en_0119986", "reviewer_id": "reviewer_en_0221685", "stars": "4", "review_body": "Gift for my mom. Not packaged terribly well, so the outter cover was a little smooshed upon arrival, but I doubt it will effect the inside calendar.", "review_title": "it's a calendar", "language": "en", "product_category": "book"}
{"review_id": "en_0662373", "product_id": "product_en_0561314", "reviewer_id": "reviewer_en_0239205", "stars": "4", "review_body": "I ordered my Xbox one X Fallout 76 bundle this past Saturday and it arrived 2 days later. I hooked up the console and so far it has been working like the dream and the graphics are far better than the original console and it is whisper quiet. The seller did an excellent job getting this xbox one bundle out to me quicker than timely. My only complaint was the fact the seal was broken and box was opened, also the controller that came with the xbox one x console was already paired with the Xbox one X which is a little discomforting. However, the console appears to be brand new as well as the controller, the fallout game that came with it is still factory sealed. No signs of this unit being used/refurbished. The console is awesome and I so far am enjoying my purchase. So far so good, the seller is awesome. The only reason I am giving this 4 stars instead of 5 is because of the package being opened. Otherwise, 5 stars all the way.", "review_title": "Excellent Console so far, but", "language": "en", "product_category": "video_games"}
{"review_id": "en_0051477", "product_id": "product_en_0456828", "reviewer_id": "reviewer_en_0711840", "stars": "4", "review_body": "The basket fits well in the bottom of my closet and holds the extras that seem to float around. the only reaso I didn’t give it 5 stars is I wished it was a little bigger.", "review_title": "Great basket!", "language": "en", "product_category": "home"}
{"review_id": "en_0817194", "product_id": "product_en_0439626", "reviewer_id": "reviewer_en_0585549", "stars": "4", "review_body": "I have had this around a year now and it is still working as it should - it lasted outside in Michigan weather, Summer / Winter. Might be the location i put it in but sometimes it doesnt come on as quickly as we would like though.", "review_title": "Pretty nice!", "language": "en", "product_category": "pet_products"}
{"review_id": "en_0535989", "product_id": "product_en_0651266", "reviewer_id": "reviewer_en_0134360", "stars": "4", "review_body": "It’s a nice squishy and looks like my mom’s favorite bread so that was a win, but it didn’t smell like pineapple at all. It had more of a chemical smell to it which isn’t good. I didn’t get it for the smell but it is a bit off putting and I’m sure it’ll fade in time.", "review_title": "Doesn’t smell like pineapple", "language": "en", "product_category": "toy"}
{"review_id": "en_0582614", "product_id": "product_en_0706943", "reviewer_id": "reviewer_en_0307430", "stars": "4", "review_body": "It arrived on time and seems to be sturdy", "review_title": "Four Stars", "language": "en", "product_category": "wireless"}
{"review_id": "en_0247725", "product_id": "product_en_0350088", "reviewer_id": "reviewer_en_0375247", "stars": "4", "review_body": "I like that I got a medium and I can make is smaller. I am 5’4 142 and if one wants it tight, you can...and if you want it with a little more breathing room, it can still be adjusted without the need to go up a size.", "review_title": "Snug fit. Nice under clothing-cannot tell", "language": "en", "product_category": "apparel"}
{"review_id": "en_0004006", "product_id": "product_en_0447520", "reviewer_id": "reviewer_en_0404751", "stars": "4", "review_body": "This was perfect for what I needed it for...deco for our back patio. I like that it’s made from a hard plastic but that it looks like metal.", "review_title": "Great decorative lantern - perfect for outdoor use!", "language": "en", "product_category": "home"}
{"review_id": "en_0073703", "product_id": "product_en_0529933", "reviewer_id": "reviewer_en_0190644", "stars": "4", "review_body": "The hose is GREAT, BUT, it took 20-30 mins to untangle it.", "review_title": "Four Stars", "language": "en", "product_category": "lawn_and_garden"}
{"review_id": "en_0932724", "product_id": "product_en_0459595", "reviewer_id": "reviewer_en_0521855", "stars": "4", "review_body": "It was very easy to put on, no problems there. It definitely adds some bulk to the pen itself which takes away from the sleek design and the comfort of holding it. I have found the pen is not as sensitive to the double tap feature with the case on nor does it charge as fast. The other reviews did state that the magnet isn’t as strong and it’s true so I wasn’t surprised. Over all I purchased this to try and preserve and protect my pencil and this does the trick but it does dull it down some.", "review_title": "You win some you loose some", "language": "en", "product_category": "pc"}
{"review_id": "en_0727734", "product_id": "product_en_0992943", "reviewer_id": "reviewer_en_0238896", "stars": "4", "review_body": "Closure doesnt always work", "review_title": "Four Stars", "language": "en", "product_category": "kitchen"}
{"review_id": "en_0041725", "product_id": "product_en_0345646", "reviewer_id": "reviewer_en_0240072", "stars": "4", "review_body": "great buy for the money. Wife likes them for short trips out of the house", "review_title": "Four Stars", "language": "en", "product_category": "shoes"}
{"review_id": "en_0063056", "product_id": "product_en_0462925", "reviewer_id": "reviewer_en_0842792", "stars": "4", "review_body": "Cute. Has to be really sunny for it to move, but I like it a lot.", "review_title": "Cute & fun", "language": "en", "product_category": "lawn_and_garden"}
{"review_id": "en_0055102", "product_id": "product_en_0920040", "reviewer_id": "reviewer_en_0514318", "stars": "4", "review_body": "helps me to remember to take my vitamins every day. Kind of wish they had an indicator with M T W Th F S Su or something like that instead of numbers.", "review_title": "Kind of wish they had an indicator with M T W Th F S Su or something like that instead of numbers", "language": "en", "product_category": "drugstore"}
{"review_id": "en_0861089", "product_id": "product_en_0647673", "reviewer_id": "reviewer_en_0800284", "stars": "4", "review_body": "I ordered these for my husband, to help with knee pain, while working out. They seem to really help provide support that he did not have prior. My only issue was the tend to slide down, so they had to be readjusted just a couple times. Comfortable material, though.", "review_title": "Comfortable material, though", "language": "en", "product_category": "drugstore"}
{"review_id": "en_0438027", "product_id": "product_en_0019417", "reviewer_id": "reviewer_en_0427041", "stars": "4", "review_body": "I love the product however I just noticed the one strap will not lay correctly because it was stitched wrong so it is twisted", "review_title": "Made wrong but would be great", "language": "en", "product_category": "apparel"}
{"review_id": "en_0910801", "product_id": "product_en_0865622", "reviewer_id": "reviewer_en_0154580", "stars": "4", "review_body": "These are good pants for just walking outside or lounging and such. They are not anything special, but they get the job done. The do get a bit more snug after wash/dry.", "review_title": "Good Pants", "language": "en", "product_category": "apparel"}
{"review_id": "en_0148113", "product_id": "product_en_0216126", "reviewer_id": "reviewer_en_0301222", "stars": "4", "review_body": "Blade was kind of dull. But otherwise fine.", "review_title": "Four Stars", "language": "en", "product_category": "other"}
{"review_id": "en_0310969", "product_id": "product_en_0149249", "reviewer_id": "reviewer_en_0897344", "stars": "4", "review_body": "Didn’t last long, but wasn’t really expecting them to.", "review_title": "Four Stars", "language": "en", "product_category": "drugstore"}
{"review_id": "en_0576779", "product_id": "product_en_0709289", "reviewer_id": "reviewer_en_0645254", "stars": "4", "review_body": "That enough for so much money", "review_title": "Getting value for my money", "language": "en", "product_category": "grocery"}
{"review_id": "en_0190630", "product_id": "product_en_0363082", "reviewer_id": "reviewer_en_0786426", "stars": "4", "review_body": "Nice clean acceleration. Didn't really get a noticeable boost in mpg, but might be a little better that might one day justify the cost. Doesn't sound like it's straining while at idle any longer.", "review_title": "Might be worth it", "language": "en", "product_category": "automotive"}
{"review_id": "en_0928586", "product_id": "product_en_0534690", "reviewer_id": "reviewer_en_0037500", "stars": "4", "review_body": "A bit snug, purchased for Mom who LOVES THEM. need more designs and colours.", "review_title": "Quality for a goid price. Fast delivery.", "language": "en", "product_category": "apparel"}
{"review_id": "en_0823215", "product_id": "product_en_0739522", "reviewer_id": "reviewer_en_0237137", "stars": "4", "review_body": "Did not seem to work for my 1 month old with gas and tummy aches, however that may just be his development and age and not necessarily colic. I will say that it is a nice quality design and the bag smells great- even if it doesn’t work for your little one, it’s a nice little heating pad to have around the house for stiff neck or sore muscles or even sinus headaches.", "review_title": "Quality product but did not help my little guy", "language": "en", "product_category": "baby_product"}
{"review_id": "en_0025014", "product_id": "product_en_0859795", "reviewer_id": "reviewer_en_0610661", "stars": "4", "review_body": "A co-worker suggested I try this product. I was looking for something to have at work. The taste is pretty good. Blending takes some time. At home I put it in the blender. Otherwise you need to have a shaker bottle or stir a long time. For creating ketones and staying in Ketosis it is worth a try.", "review_title": "Keto Catching Creamer", "language": "en", "product_category": "drugstore"}
{"review_id": "en_0567657", "product_id": "product_en_0404323", "reviewer_id": "reviewer_en_0275277", "stars": "4", "review_body": "I like vegetables though I rarely eat them, maybe trying various methods of cooking them not eating just raw will help.", "review_title": "Excellent diet book.", "language": "en", "product_category": "digital_ebook_purchase"}
{"review_id": "en_0016156", "product_id": "product_en_0677238", "reviewer_id": "reviewer_en_0776784", "stars": "4", "review_body": "Honestly it was really good, a bit bland however. I had to add a bit more seasoning to bring out some of the flavour but other than that not bad at all.", "review_title": "Not too bad", "language": "en", "product_category": "other"}
{"review_id": "en_0684137", "product_id": "product_en_0548232", "reviewer_id": "reviewer_en_0076981", "stars": "4", "review_body": "I needed last minute stockings and mantel holders. Both worked out great. Came with a set of 4 different hooks. Sturdy and worth the money!", "review_title": "Super Easy!", "language": "en", "product_category": "home"}
{"review_id": "en_0763688", "product_id": "product_en_0937691", "reviewer_id": "reviewer_en_0177417", "stars": "4", "review_body": "Not a fan of the straw. Some times if the straws not open just right it's like your tying to drink peanut butter out of the bottle, but it does keep my drinks ice cold for a long time. Might have to buy a different lid", "review_title": "Decent, Gets the job done", "language": "en", "product_category": "sports"}
{"review_id": "en_0059798", "product_id": "product_en_0870388", "reviewer_id": "reviewer_en_0610045", "stars": "4", "review_body": "Paint sprayer does a great job. Not too heavy. Included directions could use more detail (like which nozzle to use for different paint), but info available on Amazon site.", "review_title": "Easy To Use", "language": "en", "product_category": "home_improvement"}
{"review_id": "en_0512714", "product_id": "product_en_0635578", "reviewer_id": "reviewer_en_0866870", "stars": "4", "review_body": "HARD TO CLEAN SMALL HOLES IN STRAINER!! PLUGS UP JUICING CELERY", "review_title": "WASTED PULP!!", "language": "en", "product_category": "kitchen"}
{"review_id": "en_0540616", "product_id": "product_en_0256601", "reviewer_id": "reviewer_en_0369609", "stars": "4", "review_body": "worked great for my boat", "review_title": "launch wheels", "language": "en", "product_category": "other"}
{"review_id": "en_0582194", "product_id": "product_en_0828485", "reviewer_id": "reviewer_en_0803428", "stars": "4", "review_body": "Super cute but they scuff easy. A little big but very comfortable.", "review_title": "Scuff Easy", "language": "en", "product_category": "shoes"}
{"review_id": "en_0608533", "product_id": "product_en_0204685", "reviewer_id": "reviewer_en_0070588", "stars": "4", "review_body": "Rating based on the following - product as described and quick shipping. At the time of rating this product, I have not used it so I’m unable to verify how well it works for my needs. It looks better than a previous product purchased from a different seller that didn’t hold up after 3 uses. Hoping this product will be much better :)", "review_title": "Product as described!", "language": "en", "product_category": "apparel"}
{"review_id": "en_0948813", "product_id": "product_en_0317021", "reviewer_id": "reviewer_en_0247859", "stars": "4", "review_body": "good value but a little smaller than expected", "review_title": "good", "language": "en", "product_category": "furniture"}
{"review_id": "en_0541612", "product_id": "product_en_0098786", "reviewer_id": "reviewer_en_0158898", "stars": "4", "review_body": "It looks good and works well.", "review_title": "Cheaply built. Still would buy it again.", "language": "en", "product_category": "home_improvement"}
{"review_id": "en_0377605", "product_id": "product_en_0132194", "reviewer_id": "reviewer_en_0732322", "stars": "4", "review_body": "These are little plants when delivered but awesome and healthy. I can't wait to see them grow. Each one was in good shape.", "review_title": "Great little plant", "language": "en", "product_category": "lawn_and_garden"}
{"review_id": "en_0988934", "product_id": "product_en_0433529", "reviewer_id": "reviewer_en_0252527", "stars": "4", "review_body": "I love this compact bag, but the cell phone pocket is too small for my phone:( Otherwise it is very roomy for cash, credit cards and a few other essentials. Perfect when you don't want to carry a big purse.", "review_title": "Great little bag", "language": "en", "product_category": "shoes"}
{"review_id": "en_0644170", "product_id": "product_en_0435546", "reviewer_id": "reviewer_en_0223846", "stars": "4", "review_body": "When I first received the TV the volume was a little off. There was a voice telling you when the volume was turn up and down and her voice was louder than the TV. Once I got into settings and figured it out with the help of some young people the volume is perfect. It is a pretty good TV so far", "review_title": "Good TV so far", "language": "en", "product_category": "other"}
{"review_id": "en_0413928", "product_id": "product_en_0114016", "reviewer_id": "reviewer_en_0413495", "stars": "4", "review_body": "Great jacket you can use it for casual and riding a bike. Very good product on the material. Order one size more so you a have a more comfortable fit.", "review_title": "Great jacket", "language": "en", "product_category": "apparel"}
{"review_id": "en_0687388", "product_id": "product_en_0231619", "reviewer_id": "reviewer_en_0128479", "stars": "4", "review_body": "Although the one I received had a manufacture defect of an upside down image, it is cute and I have contacted the seller about it to resolve the problem. The canvas tote is well made and has leather strapping as handles.", "review_title": "Cute image of a dabbing unicorn!", "language": "en", "product_category": "home"}
{"review_id": "en_0698023", "product_id": "product_en_0504471", "reviewer_id": "reviewer_en_0344801", "stars": "4", "review_body": "The pink is brighter than I expected. It offers no real support. It does work well for holding bottles while pumping.", "review_title": "The pink is brighter than I expected. It offers ...", "language": "en", "product_category": "baby_product"}
{"review_id": "en_0689833", "product_id": "product_en_0341826", "reviewer_id": "reviewer_en_0511580", "stars": "4", "review_body": "The shorts are super adorable and comfortable if you size up. Originally purchased an XL, my normal size, they were way too tight. Returned for a XXL and they fit perfectly. They don’t look exactly like the product picture but they’re still cute.", "review_title": "Adorable shorts!!", "language": "en", "product_category": "apparel"}
{"review_id": "en_0863358", "product_id": "product_en_0352262", "reviewer_id": "reviewer_en_0638373", "stars": "4", "review_body": "Case works well, lasts about a year", "review_title": "Four Stars", "language": "en", "product_category": "wireless"}
{"review_id": "en_0148062", "product_id": "product_en_0500865", "reviewer_id": "reviewer_en_0470795", "stars": "4", "review_body": "I love the colors of this dice set! However, a lot of the white paint paint is chipping from the dots. I have one dot that is completely missing on a dot which is crappy. I will try a paint pen on it and hopefully that works well on the dice!", "review_title": "Pretty colors, not best quality", "language": "en", "product_category": "toy"}
{"review_id": "en_0896614", "product_id": "product_en_0641892", "reviewer_id": "reviewer_en_0924284", "stars": "4", "review_body": "Their site doesn't supp;y a link to driver for windows 7. It arrived two days ago and I'm waiting for a reply from Support.", "review_title": "Needs a driver for win 7", "language": "en", "product_category": "electronics"}
{"review_id": "en_0439249", "product_id": "product_en_0626146", "reviewer_id": "reviewer_en_0617484", "stars": "4", "review_body": "Plastic piece and works as described. You get what you pay for.", "review_title": "Four Stars", "language": "en", "product_category": "home"}
{"review_id": "en_0493290", "product_id": "product_en_0924313", "reviewer_id": "reviewer_en_0330657", "stars": "4", "review_body": "A decent price on batteries that store's charge way to much for.", "review_title": "Good price on button batteries", "language": "en", "product_category": "electronics"}
{"review_id": "en_0949236", "product_id": "product_en_0709759", "reviewer_id": "reviewer_en_0207318", "stars": "4", "review_body": "Love it! Keeps one fresh. Cam really tell when I don't take it.", "review_title": "Four Stars", "language": "en", "product_category": "drugstore"}
{"review_id": "en_0753261", "product_id": "product_en_0584700", "reviewer_id": "reviewer_en_0669382", "stars": "4", "review_body": "I love these socks to wander around the house in. They are too thick to wear inside shoes comfortable (to me) but they are super soft and they keep soft through many washings. My only worry is they tend to bunch up at the top and I find strings I have to cut off after almost every wash. I'm really afraid one day I'll go to put them on and they'll have lost their shape around the top. Until then, though, they are fantastic!", "review_title": "Super duper comfy!", "language": "en", "product_category": "apparel"}
{"review_id": "en_0280452", "product_id": "product_en_0763059", "reviewer_id": "reviewer_en_0301309", "stars": "4", "review_body": "My first grow with this light included in the tent. seems to be all good so far , no issues at all. Will know further when this grow finishes up. previously used two 600 watt LED's. I'll see the differences soon.", "review_title": "seems to be a good light , well built", "language": "en", "product_category": "lawn_and_garden"}
{"review_id": "en_0915908", "product_id": "product_en_0726399", "reviewer_id": "reviewer_en_0540840", "stars": "4", "review_body": "This was a winter in Milwaukee when you needed a hat and neck warmer.", "review_title": "warm and well made", "language": "en", "product_category": "apparel"}
{"review_id": "en_0625568", "product_id": "product_en_0763697", "reviewer_id": "reviewer_en_0281255", "stars": "4", "review_body": "Love this unit especially for the price. The only issue that I have is the clock will not keep the correct time. I set it and within 4 or 5 seconds it changes itself back to the original incorrect time. 5 stars if I could fix this.", "review_title": "Very nice, especially for the price", "language": "en", "product_category": "wireless"}
{"review_id": "en_0894732", "product_id": "product_en_0561332", "reviewer_id": "reviewer_en_0670673", "stars": "4", "review_body": "But maybe l an a snob. Being trained as an editor there is nothing in e-books that drives me crazier than typos, punctuation errors, incorrect words... For example 'he' instead of 'the'-those little things that autocorrect won't catch. One error of that type in a book: \"Okay, it happens.\" Two: \"Geez!\" Multiples and l want to take and shake someone. Will l check out the next book in this series? Possibly. Will l continue with it if the editing is no better? Highly doubtful.", "review_title": "Interesting enough story", "language": "en", "product_category": "digital_ebook_purchase"}
{"review_id": "en_0445303", "product_id": "product_en_0051224", "reviewer_id": "reviewer_en_0169281", "stars": "4", "review_body": "Everything about this case was fine other than the fact that I had fo file down the pink hard part near the charging port so it doesn't hurt my finger.", "review_title": "Good case", "language": "en", "product_category": "wireless"}
{"review_id": "en_0207689", "product_id": "product_en_0401739", "reviewer_id": "reviewer_en_0042925", "stars": "4", "review_body": "Fit my Revlon hair dryer well. Doesn’t wobble or move at all. I like that it has 3 air flow settings. Overall I’m happy with my purchase.", "review_title": "Fits well, has 3 settings", "language": "en", "product_category": "beauty"}
{"review_id": "en_0628880", "product_id": "product_en_0542557", "reviewer_id": "reviewer_en_0993309", "stars": "4", "review_body": "Good phone case! Just wanted something that has a flip cover that can still be used when the cover is closed", "review_title": "Good case", "language": "en", "product_category": "wireless"}
{"review_id": "en_0598476", "product_id": "product_en_0501281", "reviewer_id": "reviewer_en_0749097", "stars": "4", "review_body": "Well made and effective", "review_title": "Sharp", "language": "en", "product_category": "shoes"}
{"review_id": "en_0201056", "product_id": "product_en_0121175", "reviewer_id": "reviewer_en_0516258", "stars": "4", "review_body": "For the price, it did everything that I hope it would do and not to mention I even let my window guy try it.", "review_title": "This leveler makes the job easier.", "language": "en", "product_category": "other"}
{"review_id": "en_0036336", "product_id": "product_en_0705181", "reviewer_id": "reviewer_en_0278975", "stars": "4", "review_body": "This was an ok product. It got the job done but was a little bit of a pain to weed out.", "review_title": "This was an ok product. It got the job ...", "language": "en", "product_category": "home"}
{"review_id": "en_0096440", "product_id": "product_en_0742753", "reviewer_id": "reviewer_en_0994751", "stars": "4", "review_body": "I like all the different sections for my items; however, I wish there were a way to take off the short handles as I used only the should strap.", "review_title": "I like all the different sections for my items", "language": "en", "product_category": "shoes"}
{"review_id": "en_0019508", "product_id": "product_en_0306532", "reviewer_id": "reviewer_en_0992215", "stars": "4", "review_body": "Not bad for the price, but some of the lids give me trouble when putting them on 5.5 ounce cans - like they’re just a little bit smaller than the rest in the pack. A couple lids started splitting within a week. Overall these work well and hold up long enough.", "review_title": "Not bad for the price - Gets the job done", "language": "en", "product_category": "pet_products"}
{"review_id": "en_0600147", "product_id": "product_en_0493595", "reviewer_id": "reviewer_en_0127590", "stars": "4", "review_body": "This is great! My 8 month old thinks he can walk already but doesn't have the best balance. This gives him the support he needs so he can move with more stability. He doesn't always love wearing it because he likes us to hold his hands. But I think this will help him get more comfortable and start walking really soon", "review_title": "Cute product and it helps", "language": "en", "product_category": "baby_product"}
{"review_id": "en_0861230", "product_id": "product_en_0578520", "reviewer_id": "reviewer_en_0269354", "stars": "4", "review_body": "The best litter scoop we've had works great and is nice and large and looks like it will last forever. Feels like the metal handle ends at the bend so I tend to hold it just below the bend where it feels sturdy.", "review_title": "Nice sturdy and large", "language": "en", "product_category": "pet_products"}
{"review_id": "en_0219908", "product_id": "product_en_0386739", "reviewer_id": "reviewer_en_0272715", "stars": "4", "review_body": "I’m 5’3”, about 115 lbs and the small fit me a bit big. It wasn’t noticeable visibly so much as comfort, they fit but could be tighter over all. So I gave them to my roommate who is 5’5”, about 130 lbs and she loves them! I reordered them in grey because they didn’t have xs in Black. Over all they are cute and comfy and a solid material and I can’t wait to get my grey pair!", "review_title": "If you’re between sizes, SIZE DOWN", "language": "en", "product_category": "apparel"}
{"review_id": "en_0190507", "product_id": "product_en_0938194", "reviewer_id": "reviewer_en_0082134", "stars": "4", "review_body": "Excellent look and folds easily for storage! Super lightweight if that interests you.", "review_title": "Four Stars", "language": "en", "product_category": "lawn_and_garden"}
{"review_id": "en_0964263", "product_id": "product_en_0639976", "reviewer_id": "reviewer_en_0722403", "stars": "4", "review_body": "They do burn for approximately 1 hour. They are a bit drippy but nothing out of the ordinary. The colors are bright. Even number of each color.", "review_title": "I would buy again", "language": "en", "product_category": "home"}
{"review_id": "en_0765296", "product_id": "product_en_0157333", "reviewer_id": "reviewer_en_0143367", "stars": "4", "review_body": "This was an enjoyable story!", "review_title": "Enjoyed!", "language": "en", "product_category": "digital_ebook_purchase"}
{"review_id": "en_0644839", "product_id": "product_en_0012037", "reviewer_id": "reviewer_en_0674023", "stars": "4", "review_body": "Larger than expected but still worked well. Make sure u use acrylic glue", "review_title": "Ok", "language": "en", "product_category": "toy"}
{"review_id": "en_0443569", "product_id": "product_en_0313423", "reviewer_id": "reviewer_en_0479496", "stars": "4", "review_body": "I mostly like the longer chargers so that I can use my phone while in bed, bad habit i know. With a three pack, i also leave one in the kitchen. The charger arrived and functions as expected. Can never have too many phone chargers. I like the color scheme too, looks tough and heavy duty.", "review_title": "Always good for the bedside", "language": "en", "product_category": "wireless"}
{"review_id": "en_0581587", "product_id": "product_en_0739882", "reviewer_id": "reviewer_en_0009277", "stars": "4", "review_body": "The quality of material was better than I expected. Fits fine. A little long.", "review_title": "Little long, but good quality", "language": "en", "product_category": "apparel"}
{"review_id": "en_0845559", "product_id": "product_en_0303376", "reviewer_id": "reviewer_en_0115662", "stars": "4", "review_body": "This is an underrated landing spot as there is a lot of collectible loot with relatively little rick as not many players drop there regularly.", "review_title": "Amazing.", "language": "en", "product_category": "digital_ebook_purchase"}
{"review_id": "en_0127080", "product_id": "product_en_0708693", "reviewer_id": "reviewer_en_0153697", "stars": "4", "review_body": "It's sturdy and cute altogether, but the phone in general wasn't for me.", "review_title": "Four Stars", "language": "en", "product_category": "wireless"}
{"review_id": "en_0937679", "product_id": "product_en_0947322", "reviewer_id": "reviewer_en_0459287", "stars": "4", "review_body": "Love belt clip. Should have felt in holster And enclosed corners but really like", "review_title": "Nice", "language": "en", "product_category": "wireless"}
{"review_id": "en_0985224", "product_id": "product_en_0100872", "reviewer_id": "reviewer_en_0161005", "stars": "4", "review_body": "I like it, and am glad I purchased it. The only problem I'm having with it is the comes undone easily. The smallest size they carry is for a 26\" waste, and mine is a little smaller.", "review_title": "Nice belt", "language": "en", "product_category": "apparel"}
{"review_id": "en_0623298", "product_id": "product_en_0697753", "reviewer_id": "reviewer_en_0146431", "stars": "4", "review_body": "These are great for my mom's walker, but I also have to buy several sets at a time. They wear out really quickly. My mom is fairly active and goes out most days so the sidewalks and parking lots ruin these very fast. That's our only complaint. Otherwise a great product to help keep her moving and if there was a way to extend their life I would give 5 stars.", "review_title": "Wears out fast", "language": "en", "product_category": "drugstore"}
{"review_id": "en_0454305", "product_id": "product_en_0278079", "reviewer_id": "reviewer_en_0631803", "stars": "4", "review_body": "Way better than Stevia. No bad aftertaste like Stevia or Truvia! If you are substituting for sugar, I would just add about 30% more than the recipe calls for.", "review_title": "Love this sugar substitute", "language": "en", "product_category": "grocery"}
{"review_id": "en_0386657", "product_id": "product_en_0477118", "reviewer_id": "reviewer_en_0015992", "stars": "4", "review_body": "It’s very nice . Good size bright. Just not towel material.", "review_title": "Great for hanging up or relaxing on", "language": "en", "product_category": "home"}
{"review_id": "en_0855786", "product_id": "product_en_0674142", "reviewer_id": "reviewer_en_0696735", "stars": "4", "review_body": "1 string broke! Product came with a second set so after replacing it which took some time was great! Good for kids! So affordable and nice size! Tuner is nice. Turns green when in tune! This product would have got 5 stars had the 1st string not broken!", "review_title": "Thanks to a second set of strings!", "language": "en", "product_category": "musical_instruments"}
{"review_id": "en_0422440", "product_id": "product_en_0122169", "reviewer_id": "reviewer_en_0470662", "stars": "4", "review_body": "Good story, but a bit too short. Just when I was getting into it, the story wrapped in a paragraph!", "review_title": "Good story, but a bit too short", "language": "en", "product_category": "digital_ebook_purchase"}
{"review_id": "en_0350372", "product_id": "product_en_0251010", "reviewer_id": "reviewer_en_0344714", "stars": "4", "review_body": "Sooo many comes in a cute little zip log sorta bag. My daughter loves them enjoys having cute stuff in her hair so it makes hair time easier for us.", "review_title": "Kids will love them", "language": "en", "product_category": "beauty"}
{"review_id": "en_0777935", "product_id": "product_en_0583937", "reviewer_id": "reviewer_en_0181561", "stars": "4", "review_body": "It was just like they said it was", "review_title": "Perfect", "language": "en", "product_category": "pet_products"}
{"review_id": "en_0329481", "product_id": "product_en_0574528", "reviewer_id": "reviewer_en_0426305", "stars": "4", "review_body": "Awesome snorkel set! First set I bought that didn’t take water in the mouth piece when diving down and breaking the surface again. Fin is nice and stiff, goggles and mouth piece very comfortable. One thing to note: sizes run large/wide. I am women’s size 7/8 so I bought the S/M. It was wider and larger than I would prefer, so I had to tighten the strap all the way, but did not have problems with the fin slipping off.", "review_title": "Great set but size down!", "language": "en", "product_category": "other"}
{"review_id": "en_0515201", "product_id": "product_en_0827555", "reviewer_id": "reviewer_en_0060086", "stars": "4", "review_body": "Love the colors & works well with my versa!", "review_title": "Sport bands", "language": "en", "product_category": "sports"}
{"review_id": "en_0115646", "product_id": "product_en_0373990", "reviewer_id": "reviewer_en_0971716", "stars": "4", "review_body": "I am a Minister and I use hundreds of these CR2032 batteries for my religious services in prayer candles every year. I have tried over 15 different brands on Amazon over the past few years and so far this SONY brand has shown the most reliability of any other brands I have tried. Other brands have been cheaper but they also die at an alarming rate thus making the cost go up greatly as I constantly have to replace them with new batteries. I get approximately 5-7 days of use from these batteries as opposed to other brands which vary from 1-3 days with a rapid discharge rate that takes just a few hours to go from a correct level of light to dead in hours. Save your money and time hunting and try these SONY CR2032 batteries. I will keep looking for a LONGER LASTING battery but for now these are the ones I will use until something better comes around. God Bless! Rev. D.", "review_title": "Great Value and Quality", "language": "en", "product_category": "other"}
{"review_id": "en_0859500", "product_id": "product_en_0498315", "reviewer_id": "reviewer_en_0904239", "stars": "4", "review_body": "Pretty good case I like that it has some grip to it", "review_title": "Great cae", "language": "en", "product_category": "wireless"}
{"review_id": "en_0154634", "product_id": "product_en_0316007", "reviewer_id": "reviewer_en_0394707", "stars": "4", "review_body": "My kids all have their own laundry hampers. My daughters broke and so I got this one, I like that it is slim and fits in a small place. It's not huge but I didn't want huge because that means I let the laundry build longer. Great hamper!", "review_title": "Slim laundry basket", "language": "en", "product_category": "home"}
{"review_id": "en_0258355", "product_id": "product_en_0546294", "reviewer_id": "reviewer_en_0618029", "stars": "4", "review_body": "I actually bought this again for my brother. Personally, I don't feel anything after talking a full bottle. My brother also said he didn't feel anything after taking it. But he still wants it and told me to buy it from Amazon because I am a prime member and he isn't. He said it's probably good if you don't feel anything. Hm...", "review_title": "He said it's probably good if you don't feel anything", "language": "en", "product_category": "drugstore"}
{"review_id": "en_0220621", "product_id": "product_en_0278792", "reviewer_id": "reviewer_en_0978559", "stars": "4", "review_body": "Came quick, is just as pictured and my daughter loves it. Only thing I do not enjoy is how annoying to alarm tones are. There are several to chose from but they are all very abrasive 90s ringtone-esque. My daughter likes them so I guess thats all that matters.", "review_title": "Only thing I do not enjoy is how annoying to alarm tones are", "language": "en", "product_category": "home"}
{"review_id": "en_0002858", "product_id": "product_en_0550456", "reviewer_id": "reviewer_en_0158226", "stars": "4", "review_body": "I like the convenience of not having to go to a salon to get my brows done anymore and that it is painless to use.", "review_title": "Easy to use but does not get 100% all areas you desire to have cleaned up.", "language": "en", "product_category": "beauty"}
{"review_id": "en_0771528", "product_id": "product_en_0439509", "reviewer_id": "reviewer_en_0767482", "stars": "4", "review_body": "I got this headphone last month. Until now they work great for me: they never come off while I'm running and the sound is really good!", "review_title": "Satisfied", "language": "en", "product_category": "electronics"}
{"review_id": "en_0088419", "product_id": "product_en_0759872", "reviewer_id": "reviewer_en_0200096", "stars": "4", "review_body": "I put this together, and my pup went right in. I put a crate pad in it, and now it's his favorite place to go.", "review_title": "Nice and sturdy. Easy to put up.", "language": "en", "product_category": "pet_products"}
{"review_id": "en_0475771", "product_id": "product_en_0532613", "reviewer_id": "reviewer_en_0463423", "stars": "4", "review_body": "Suspend your analytic mind for a while for this thrilling, adventure. Liked it, will go for book 4. Fun adventure story.", "review_title": "Good thriller!", "language": "en", "product_category": "digital_ebook_purchase"}
{"review_id": "en_0163097", "product_id": "product_en_0066411", "reviewer_id": "reviewer_en_0074420", "stars": "4", "review_body": "The flowers are hard to get out but all around it worked great", "review_title": "Very good", "language": "en", "product_category": "toy"}
{"review_id": "en_0666052", "product_id": "product_en_0158673", "reviewer_id": "reviewer_en_0285656", "stars": "4", "review_body": "Holding together we'll after several wears. Belt is detachable, but therefore has fallen off a couple times. Thin material, so my son wears a thin layer underneath.", "review_title": "Thumbs up", "language": "en", "product_category": "toy"}
{"review_id": "en_0082075", "product_id": "product_en_0077722", "reviewer_id": "reviewer_en_0186326", "stars": "4", "review_body": "You'll need another programmer to replace the bootloader, but you can make one out of a working Arduino, otherwise you'll see a lot of timeout errors.", "review_title": "Old bootloader, reflash it for a better experience", "language": "en", "product_category": "kitchen"}
{"review_id": "en_0252585", "product_id": "product_en_0896183", "reviewer_id": "reviewer_en_0447252", "stars": "4", "review_body": "Comfortable shirt. Just a bit snugger than I would have liked. Size up.", "review_title": "Was just ok", "language": "en", "product_category": "apparel"}
{"review_id": "en_0010125", "product_id": "product_en_0599064", "reviewer_id": "reviewer_en_0183063", "stars": "4", "review_body": "Having the Big Book in my smartphone and Kindle e-reader is really a great convenience. I prefer it over a paper copy in Big Book study meetings, because I can add highlights and notes and easily find them later. Searching the text is also a great advantage. I haven't personally found any textual errors The page numbers are broken, though. In the current (as of Oct. 30, 2019) update of the book, \"go to page\" searches are useless. For example, go to page 86 takes you to page 165 of the actual book. Previous updates worked correctly, and I'm confident the publisher will correct the problem, but for now it's annoying and renders the e-book less useful.", "review_title": "Latest update broke the page numbers", "language": "en", "product_category": "digital_ebook_purchase"}
{"review_id": "en_0658721", "product_id": "product_en_0498930", "reviewer_id": "reviewer_en_0250905", "stars": "4", "review_body": "This sports bra runs very small I normally wear a small for running or medium if just doing weights. Based on the reviews I ordered a large and it does fit very well without any bulging. It didn’t move around I didn’t think anything was going to fall out. But I wish it gave me a more support like a regular bra does. I’m a 34B, 5’ 6” and 132 pounds. Overall I like the bra. The quality was pretty good for the price. Not flimsy and should hold up. I love the strappy look in the back! I’m giving it four stars only because I wished it gave me a better shape in the front. I will still be ordering more of these.", "review_title": "Runs small", "language": "en", "product_category": "apparel"}
{"review_id": "en_0981004", "product_id": "product_en_0696644", "reviewer_id": "reviewer_en_0980991", "stars": "4", "review_body": "I have purchased several of these balloons to the enjoyment of my children. I have only received one bad batch where the balloons looked like they had melted into one another. And the pump broke on the second good balloon. But other than that, loads of fun for your children and the adults that want to use their hot air to entertain them!", "review_title": "I have purchased several of these balloons to the enjoyment of my children", "language": "en", "product_category": "toy"}
{"review_id": "en_0952821", "product_id": "product_en_0811108", "reviewer_id": "reviewer_en_0914621", "stars": "4", "review_body": "I loved the color and shape but they are a bit larger (width) than I prefer but all around for the price they are very nice.", "review_title": "They are very shiny & large", "language": "en", "product_category": "jewelry"}
{"review_id": "en_0839923", "product_id": "product_en_0005447", "reviewer_id": "reviewer_en_0394333", "stars": "4", "review_body": "Works very well. It is loud and if anyone moves my car door or opens it will go off. It also went off when I shut my other doors and shook the car hard. I tested to see if it goes off if I lean on the door or near it and it didn’t, so it is not likely to have that many false alarms. If anyone tries to harm your car or break in, they will need more force that just a simple lean or tap. Instructions in English and not too difficult to figure out. Going to buy this for my home door. Would give it five stars if it was more sensitive and loud but t will do the trick and is great for the money", "review_title": "Loud, it works good price, false alarms not likely", "language": "en", "product_category": "camera"}
{"review_id": "en_0233420", "product_id": "product_en_0206513", "reviewer_id": "reviewer_en_0254512", "stars": "4", "review_body": "Everett and Sylvia are another meet cute romance crafted by Nolan. She seems to have this type of story down to an art - the quick read that sets up the romantic pick me up. Great rrad.", "review_title": "Heirloom meet cute", "language": "en", "product_category": "digital_ebook_purchase"}
{"review_id": "en_0687014", "product_id": "product_en_0854464", "reviewer_id": "reviewer_en_0463662", "stars": "4", "review_body": "Did not like left stem breaking in half like a brittle pretzel only after 4 months .", "review_title": "Brittle stems of Knight Visors.", "language": "en", "product_category": "shoes"}
{"review_id": "en_0730424", "product_id": "product_en_0715532", "reviewer_id": "reviewer_en_0665360", "stars": "4", "review_body": "Works well, having the two zippers is handy when you want to carry a phone and not have all your money/cards go flying when having to remove the phone for use. My daughter uses this one mostly as I preferred one with a bigger pocket but it's more her style and more like a belt than a fanny pack which at 19 years old is apparently a big deal!!", "review_title": "Handy that it has the two zippered pockets.", "language": "en", "product_category": "sports"}
{"review_id": "en_0208593", "product_id": "product_en_0904020", "reviewer_id": "reviewer_en_0698199", "stars": "4", "review_body": "I really like this fitness watch. I like that it tracks my steps, heart rate, and sleep. My only issues that I’ve ran into have been that I hit something once that started a timer and for an hour it ran while I tried to figure out how to turn it off. I still don’t know how it came on and how it eventually turned off. The charger is a little bit of a pain. Other than that I really like the watch itself. It also is at a great price!", "review_title": "Good basic fitness watch", "language": "en", "product_category": "sports"}
{"review_id": "en_0982862", "product_id": "product_en_0215681", "reviewer_id": "reviewer_en_0117910", "stars": "4", "review_body": "This little gadget makes cutting blocks of cheese soooo much faster. It doesn’t work great on softer cheeses, but it still does a decent job. My only complaint is you need to use it at the end of the counter if you want to cut all the way through the cheese so you can get the right angle to cut completely through the bottom. But for less then $5, I’ll deal with it!", "review_title": "Great deal!", "language": "en", "product_category": "kitchen"}
{"review_id": "en_0400467", "product_id": "product_en_0091404", "reviewer_id": "reviewer_en_0002999", "stars": "4", "review_body": "Just needed to get a change in cases", "review_title": "Four Stars", "language": "en", "product_category": "wireless"}
{"review_id": "en_0432690", "product_id": "product_en_0293381", "reviewer_id": "reviewer_en_0411257", "stars": "4", "review_body": "Very good and clean. Great deal for the money.", "review_title": "Good deal", "language": "en", "product_category": "beauty"}
{"review_id": "en_0115407", "product_id": "product_en_0301588", "reviewer_id": "reviewer_en_0579785", "stars": "4", "review_body": "Nice quality of boards, not slippery After using a while there’re stains which don’t go out but it doesn’t effect its purpose", "review_title": "Good boards", "language": "en", "product_category": "kitchen"}
{"review_id": "en_0346851", "product_id": "product_en_0246621", "reviewer_id": "reviewer_en_0915431", "stars": "4", "review_body": "A bit tight on my big head but I’m excited to put to use kinda smelled a bit weird but it’s fine", "review_title": "Excited to use", "language": "en", "product_category": "other"}
{"review_id": "en_0000841", "product_id": "product_en_0850648", "reviewer_id": "reviewer_en_0472525", "stars": "4", "review_body": "I've bought a few different types of wrap-around LED lights in the past couple of years. I thought this design was one of the better ones. The way the plastic lens mounts into the light is clever and it is easy to remove and re-mount. In a garage or a shop with a high ceiling, these lights would cover a big footprint with nice, intense light. In my basement application, where the ceiling is low and the joists collimate the light, more fixtures are needed than I originally imagined, but it's still pretty affordable.", "review_title": "nicely designed LED wrap-around lights", "language": "en", "product_category": "home_improvement"}
{"review_id": "en_0738488", "product_id": "product_en_0312791", "reviewer_id": "reviewer_en_0050405", "stars": "4", "review_body": "This band is just what I needed. It is soft and breathes good enough to evaporate the sweat from my arm while running.", "review_title": "Soft, strong and breathable for active use", "language": "en", "product_category": "watch"}
{"review_id": "en_0822106", "product_id": "product_en_0779187", "reviewer_id": "reviewer_en_0552090", "stars": "4", "review_body": "Great! Except I thought the aluminum letters would be shinier. More like chrome. However I think the duller looks better on the front of my car 🤷🏼‍♀️", "review_title": "Great Make - Not Very Shiny", "language": "en", "product_category": "automotive"}
{"review_id": "en_0549001", "product_id": "product_en_0856175", "reviewer_id": "reviewer_en_0452713", "stars": "4", "review_body": "Does the job giving support. And adjustable when it loosens up.", "review_title": "Four Stars", "language": "en", "product_category": "drugstore"}
{"review_id": "en_0532172", "product_id": "product_en_0867698", "reviewer_id": "reviewer_en_0529786", "stars": "4", "review_body": "I really like that the water from my dishes drain in to my sink. Even though dishes are on the rack I can still see outside the window! I do not like the fact that I have to pay extra for a silverware tray. It is always needed& should come with the rack!", "review_title": "I really like that the water from my dishes drain in to ...", "language": "en", "product_category": "kitchen"}
{"review_id": "en_0416425", "product_id": "product_en_0806985", "reviewer_id": "reviewer_en_0657793", "stars": "4", "review_body": "The HP branded laser-jet ink seems way over-priced, but it works.", "review_title": "Overpriced, but sure beats ink-jet.", "language": "en", "product_category": "office_product"}
{"review_id": "en_0108580", "product_id": "product_en_0309651", "reviewer_id": "reviewer_en_0038555", "stars": "4", "review_body": "Nice content and covers a lot of ground but it does get a little repetitive at times.", "review_title": "Four Stars", "language": "en", "product_category": "book"}
{"review_id": "en_0796387", "product_id": "product_en_0235093", "reviewer_id": "reviewer_en_0273106", "stars": "4", "review_body": "I liked the historical background coupled with relevant action. Certainly, one gets a feel for the trials and tribulations of being a mountain man.", "review_title": "Good read", "language": "en", "product_category": "digital_ebook_purchase"}
{"review_id": "en_0178761", "product_id": "product_en_0466163", "reviewer_id": "reviewer_en_0090477", "stars": "4", "review_body": "Donated but cute and good quality", "review_title": "Good product", "language": "en", "product_category": "luggage"}
{"review_id": "en_0867660", "product_id": "product_en_0543840", "reviewer_id": "reviewer_en_0719489", "stars": "4", "review_body": "I liked the characters and the developing relationships. The suspense and uncertainty in the plot kept me reading.", "review_title": "Enjoy!", "language": "en", "product_category": "digital_ebook_purchase"}
{"review_id": "en_0159458", "product_id": "product_en_0176624", "reviewer_id": "reviewer_en_0316531", "stars": "4", "review_body": "It’s a pretty good brush for the price point. Over the first few uses some of the bristles came out on my face.", "review_title": "It’s fine.", "language": "en", "product_category": "beauty"}
{"review_id": "en_0919190", "product_id": "product_en_0217363", "reviewer_id": "reviewer_en_0134267", "stars": "4", "review_body": "Way too long. I'm 5'5\" and need it taken up 3 inches", "review_title": "Four Stars", "language": "en", "product_category": "apparel"}
{"review_id": "en_0353776", "product_id": "product_en_0152138", "reviewer_id": "reviewer_en_0228750", "stars": "4", "review_body": "This book goes up against an easy to use and simple to take after outline that will enable you to achieve your weight reduction objectives on the ketogenic eat less more rapidly and strongly than before.This eating regimen takes after the Atkins thin down and other low-carb diets.The recipes are incredibly alluring and at first look enough fundamental.i particularly recommend this.", "review_title": "This book goes up against an easy to use and simple to take after outline that ...", "language": "en", "product_category": "digital_ebook_purchase"}
{"review_id": "en_0826667", "product_id": "product_en_0982963", "reviewer_id": "reviewer_en_0407551", "stars": "4", "review_body": "I love these glasses very good condition as I expected it.", "review_title": "That they are 8oz so not too big glasses", "language": "en", "product_category": "kitchen"}
{"review_id": "en_0030598", "product_id": "product_en_0727629", "reviewer_id": "reviewer_en_0880893", "stars": "4", "review_body": "The chair is great, but the need to unscrew the foot rest to collapse the chair really takes away from the ease of use.", "review_title": "Disassembly required to close the chair.", "language": "en", "product_category": "furniture"}
{"review_id": "en_0039246", "product_id": "product_en_0920204", "reviewer_id": "reviewer_en_0198133", "stars": "4", "review_body": "I really like the look of this band, but there's one thing: when I'm wearing it, if the watch is centered on the top of my wrist, the buckle isn't centered on the bottom. It's almost as if the buckle portion of the band is slightly shorter than \"normal\" and the part with the holes is slightly longer (see image). On the whole I'm happy with it, but this quirk is distracting.", "review_title": "Comfortable but awkward?", "language": "en", "product_category": "wireless"}
{"review_id": "en_0837223", "product_id": "product_en_0617428", "reviewer_id": "reviewer_en_0382250", "stars": "4", "review_body": "The hinge came malfunctioned i contacted and would have to resend tje whole thing they wont just replace the hinge was very upset but my daughter loves it", "review_title": "Hinge is malfunctioned", "language": "en", "product_category": "baby_product"}
{"review_id": "en_0061639", "product_id": "product_en_0961304", "reviewer_id": "reviewer_en_0749851", "stars": "4", "review_body": "I got this bag to carry my commander decks and a few other things. Positioning the dividers are a pain to move around but they do their job well once in place. I was a tad disappointed with the fact that only the 2 sides open to the main compartment, and didnt open on one whole side. Also, another neat thing is, if you have the hips for it, you can also wear it like a hip bag so it's more out of the way and everything is still easy to grab. Other than that, fairly good bag, very durable", "review_title": "MTG capable", "language": "en", "product_category": "camera"}
{"review_id": "en_0135562", "product_id": "product_en_0434821", "reviewer_id": "reviewer_en_0836179", "stars": "4", "review_body": "It’s a good quality jacket for the price. It keeps you very warm (you’ll sweat if you are indoors) It’s firmly stitched - and the stitches won’t loosen or come off. So it looks quite durable. The overall look of the jacket is surprisingly quite good. The size is just right. The only thing I’d say is that it’s a little puffy - only slightly. It’s not thin - but is very light.", "review_title": "Good warm winter jacket.", "language": "en", "product_category": "apparel"}
{"review_id": "en_0328426", "product_id": "product_en_0579123", "reviewer_id": "reviewer_en_0918979", "stars": "4", "review_body": "Nice foundation. Pretty perfect color match. With his foundation a little goes a long way. Even though It is a full coverage foundation, it does not feel heavy on the skin. It does dry quickly, so just keep that in mind. Also it works well thigh other non Revlon products well. I primarily use E.L.F and Smashbox primers. And either Nyx or Slay setting spray. This foundation held up beautifully. The only reason, I did not give 5 stars is because there is no pump. I just transferred it a bottle with a pump and I was good to go.", "review_title": "Good Buy", "language": "en", "product_category": "beauty"}
{"review_id": "en_0617083", "product_id": "product_en_0649081", "reviewer_id": "reviewer_en_0835951", "stars": "4", "review_body": "Works good in protecting the phone but had to cut the plastic off in order to make phone calls. It interfered will the sound.", "review_title": "Good product", "language": "en", "product_category": "sports"}
{"review_id": "en_0049329", "product_id": "product_en_0900871", "reviewer_id": "reviewer_en_0013140", "stars": "4", "review_body": "Nice, good quality. But they stretch out and stay stretched", "review_title": "Leggings", "language": "en", "product_category": "electronics"}
{"review_id": "en_0186483", "product_id": "product_en_0665027", "reviewer_id": "reviewer_en_0490280", "stars": "4", "review_body": "This book started off pretty slow. But it soon got better. After the first few chapters I couldn't put it down. What a wonderful read. I love psychological thrillers, and this book was certainly a good one.", "review_title": "Good read", "language": "en", "product_category": "digital_ebook_purchase"}
{"review_id": "en_0822176", "product_id": "product_en_0939562", "reviewer_id": "reviewer_en_0676866", "stars": "4", "review_body": "Screws are a bit short, but still really pretty.", "review_title": "Short screws but pretty!", "language": "en", "product_category": "home_improvement"}
{"review_id": "en_0871354", "product_id": "product_en_0766903", "reviewer_id": "reviewer_en_0129348", "stars": "4", "review_body": "Authentic but long winded", "review_title": "Reasonable book, informative", "language": "en", "product_category": "book"}
{"review_id": "en_0358650", "product_id": "product_en_0236219", "reviewer_id": "reviewer_en_0875055", "stars": "4", "review_body": "These are very comfortable and I really like them all but the slick soles. I put the skid resistance stickers on them and they help but the don't stay on long.", "review_title": "Nice house slippers.", "language": "en", "product_category": "shoes"}
{"review_id": "en_0851332", "product_id": "product_en_0912582", "reviewer_id": "reviewer_en_0792487", "stars": "4", "review_body": "A decent spare pair of sunglasses. I have been leaving these in my car for those times I forget to bring sunglasses when I go out.", "review_title": "Pretty good pair of sunglasses", "language": "en", "product_category": "shoes"}
{"review_id": "en_0827181", "product_id": "product_en_0211100", "reviewer_id": "reviewer_en_0859444", "stars": "4", "review_body": "Bought this last minute for a funeral (thank you Prime!) it arrived that morning and fit perfectly. Got several complements, great for the price. Arrived pretty wrinkled but came right out", "review_title": "great for the price", "language": "en", "product_category": "apparel"}
{"review_id": "en_0132958", "product_id": "product_en_0154589", "reviewer_id": "reviewer_en_0823513", "stars": "4", "review_body": "Got the non-ceramic non-stick plates and I love it. After almost two years of weekly use, the non-stick surface still works relatively well. As it got older, it doesn't heat as well. Before my preferred temperature was 2 out of 3, but now I need to start with 3 and leave it a little longer for the first waffle. Still like it.", "review_title": "Non-stick works great and easy to clean", "language": "en", "product_category": "kitchen"}
{"review_id": "en_0729576", "product_id": "product_en_0285054", "reviewer_id": "reviewer_en_0414813", "stars": "4", "review_body": "This was super cute. I only wish I hadn’t sized up. I read some reviews that said it ran small so I got a bigger size. I would have been fine with my normal size. Either way I wore it and my little boy thought it was funny.", "review_title": "Don’t size up", "language": "en", "product_category": "apparel"}
{"review_id": "en_0685923", "product_id": "product_en_0303332", "reviewer_id": "reviewer_en_0879535", "stars": "4", "review_body": "ok, but a littel small", "review_title": "ok", "language": "en", "product_category": "other"}
{"review_id": "en_0080532", "product_id": "product_en_0914376", "reviewer_id": "reviewer_en_0097213", "stars": "4", "review_body": "Exactly as I had hoped", "review_title": "Four Stars", "language": "en", "product_category": "toy"}
{"review_id": "en_0215352", "product_id": "product_en_0749949", "reviewer_id": "reviewer_en_0235908", "stars": "4", "review_body": "these are just fine. they do the job", "review_title": "Four Stars", "language": "en", "product_category": "automotive"}
{"review_id": "en_0499471", "product_id": "product_en_0368638", "reviewer_id": "reviewer_en_0730384", "stars": "4", "review_body": "As others stated - FRONT POCKETS ARE TINY. My phone will fall out while standing up, let alone sitting down. Other than that... these shorts are great, exactly what I wanted. Big, thick and comfy at a great price", "review_title": "Great shorts, great price..Tiny Pockets", "language": "en", "product_category": "apparel"}
{"review_id": "en_0627691", "product_id": "product_en_0772629", "reviewer_id": "reviewer_en_0335467", "stars": "4", "review_body": "*Read the label when buying Protein Supplements *Do some research *Amazons Own Pwr Blend has what you need in the ingredients. Whey Isolate (Quickly Absorbed) , Milk Isolate and Micellar Casein (Slow Release) Its also not as expensive as compared to some other brands which is a big plus. *Taste which to me doesn't matter to much, if the product has the right ingredients ill use it. The Vanilla Ice cream is good, drinkable, no issues but a little on the artificially sweet side. Overall totally worth your money!", "review_title": "Ingredients are whats important", "language": "en", "product_category": "drugstore"}
{"review_id": "en_0415332", "product_id": "product_en_0465505", "reviewer_id": "reviewer_en_0813284", "stars": "4", "review_body": "Wire is on the weak side. No good for active users. Have had a couple of them getting cought on furniture and wires being pulled out of plug. Cheap enough.", "review_title": "On the cheap side.", "language": "en", "product_category": "wireless"}
{"review_id": "en_0848305", "product_id": "product_en_0045061", "reviewer_id": "reviewer_en_0106763", "stars": "4", "review_body": "They fit any toddler pillow and never fall out (due to envelope style), which is great. A little long on the edges for my pillows, but a decent buy.", "review_title": "Good for toddler and travel pillows", "language": "en", "product_category": "baby_product"}
{"review_id": "en_0382100", "product_id": "product_en_0759497", "reviewer_id": "reviewer_en_0191352", "stars": "4", "review_body": "We use this as an organizer on my kitchen counter, to replace an ever over-flowing junk bowl. Its really great and helps us cut down on clutter!", "review_title": "Very cute and spacious", "language": "en", "product_category": "office_product"}
{"review_id": "en_0917598", "product_id": "product_en_0237815", "reviewer_id": "reviewer_en_0327505", "stars": "4", "review_body": "This product does what it's supposed to do. Mine could have been a little smaller.", "review_title": "Four Stars", "language": "en", "product_category": "apparel"}
{"review_id": "en_0727371", "product_id": "product_en_0665231", "reviewer_id": "reviewer_en_0717554", "stars": "4", "review_body": "I was looking for a light that would hold a charge and this one didn't let me down. It is also very bright and will keep me in safety while riding.", "review_title": "Bright, last for a very long time", "language": "en", "product_category": "other"}
{"review_id": "en_0362843", "product_id": "product_en_0127695", "reviewer_id": "reviewer_en_0074427", "stars": "4", "review_body": "With no experience to draw from and only going from recommendations from others as to the weight of the BB's, I purchased this brand based on the number of positive reviews and the price/quantity. So far no issues...", "review_title": "With no experience to draw from and only going from ...", "language": "en", "product_category": "sports"}
{"review_id": "en_0024772", "product_id": "product_en_0993173", "reviewer_id": "reviewer_en_0026029", "stars": "4", "review_body": "Works as advertised. The design is awkward in that it extends just enough to cover two plugs. And all the rings are annoying except the first one. :)", "review_title": "Awkward shape but works well.", "language": "en", "product_category": "home_improvement"}
{"review_id": "en_0091130", "product_id": "product_en_0078051", "reviewer_id": "reviewer_en_0019534", "stars": "4", "review_body": "Not one size, if yuo have a large head it is a little tight.", "review_title": "Four Stars", "language": "en", "product_category": "sports"}
{"review_id": "en_0167794", "product_id": "product_en_0618858", "reviewer_id": "reviewer_en_0391204", "stars": "4", "review_body": "So weird but sooo good!", "review_title": "Four Stars", "language": "en", "product_category": "book"}
{"review_id": "en_0608851", "product_id": "product_en_0136397", "reviewer_id": "reviewer_en_0456003", "stars": "4", "review_body": "Good phone case gets the job done. Cheap. Holds up to 3 cards. I had this case for the iPhone 6 but the only problem for the 8 is that it’s pretty bulky.", "review_title": "Good phone case gets the job done", "language": "en", "product_category": "wireless"}
{"review_id": "en_0703599", "product_id": "product_en_0770724", "reviewer_id": "reviewer_en_0914422", "stars": "4", "review_body": "While this product has rather mild taste to it, I don't find it to make the product any lesser for it.", "review_title": "A nice mild taste", "language": "en", "product_category": "other"}
{"review_id": "en_0786240", "product_id": "product_en_0110055", "reviewer_id": "reviewer_en_0939318", "stars": "4", "review_body": "I bought this brush to add exfoliating more often in my skin care routine. I love that it's light weight and comfortable to hold. It's easy to switch speeds while in use. Most important to me, since I have really sensitive skin,is that the bristles are really soft but effective. Another plus is it stays charged for a long while (mine does anyway). I will recommend after useing and washing the brush, pat it dry with a clean towel. I noticed the first time I used it I capped it and even with the air vent in the cap it stayed wet, so definitely pat with towel after use. One other thing its comes with the charging cable but you will need a charging port, but heck like lots of people I had an extra so that was easy :)", "review_title": "Cleansing Brush", "language": "en", "product_category": "beauty"}
{"review_id": "en_0141244", "product_id": "product_en_0560214", "reviewer_id": "reviewer_en_0961324", "stars": "4", "review_body": "Very happy with this purchase.", "review_title": "Four Stars", "language": "en", "product_category": "kitchen"}
{"review_id": "en_0377645", "product_id": "product_en_0168921", "reviewer_id": "reviewer_en_0795891", "stars": "4", "review_body": "Love this mirror.. highly recommend", "review_title": "Satified customer", "language": "en", "product_category": "beauty"}
{"review_id": "en_0038321", "product_id": "product_en_0763842", "reviewer_id": "reviewer_en_0500517", "stars": "4", "review_body": "One handed use makes driving safer. So far the mount seems secure; 100+ temperatures next summer will be a good test.", "review_title": "One handed convenience", "language": "en", "product_category": "wireless"}
{"review_id": "en_0588560", "product_id": "product_en_0556654", "reviewer_id": "reviewer_en_0765731", "stars": "4", "review_body": "So the set up was a nightmare took hrs to set up. Can only be done on your phone. What helped me was turing off my cell data. Haven’t tried the music or any special features yet. Really just need it to check on the kids. Would recommend if your willing to save money for a decent product with a lot of work to set up.", "review_title": "You get what you pay for", "language": "en", "product_category": "camera"}
{"review_id": "en_0260198", "product_id": "product_en_0101721", "reviewer_id": "reviewer_en_0312198", "stars": "4", "review_body": "Great product! Ordered large and a medium would have worked better.", "review_title": "Runs large", "language": "en", "product_category": "pet_products"}
{"review_id": "en_0903657", "product_id": "product_en_0988941", "reviewer_id": "reviewer_en_0939184", "stars": "4", "review_body": "Nice heavy T-shirt for the price I paid!!", "review_title": "Nice T shirt", "language": "en", "product_category": "apparel"}
{"review_id": "en_0670381", "product_id": "product_en_0989008", "reviewer_id": "reviewer_en_0243762", "stars": "4", "review_body": "Like the kit but the rubber holder should be a little bigger to hold the club closer to the grip it would make it easier but it still works", "review_title": "Like the kit but the rubber holder should be a ...", "language": "en", "product_category": "sports"}
{"review_id": "en_0159223", "product_id": "product_en_0999824", "reviewer_id": "reviewer_en_0136285", "stars": "4", "review_body": "Sometimes comes unclipped.", "review_title": "Four Stars", "language": "en", "product_category": "toy"}
{"review_id": "en_0760732", "product_id": "product_en_0130176", "reviewer_id": "reviewer_en_0152877", "stars": "4", "review_body": "Its ok, I probably would have chosen something a bit more substantial. I'm using them to secure Hobie pedal drives and seats on a tandem island. I hope they hold on to them if I dump it and they come loose. For the use I chose I would have been a bit happier with a larger strap, but they should work great for rods and paddles which might be where they end up.", "review_title": "Not great not bad", "language": "en", "product_category": "other"}
{"review_id": "en_0250529", "product_id": "product_en_0392671", "reviewer_id": "reviewer_en_0529023", "stars": "4", "review_body": "looks nice for the price", "review_title": "Four Stars", "language": "en", "product_category": "apparel"}
{"review_id": "en_0224196", "product_id": "product_en_0887688", "reviewer_id": "reviewer_en_0314168", "stars": "4", "review_body": "I'll let u no as I use it", "review_title": "Haven't use it yet", "language": "en", "product_category": "other"}
{"review_id": "en_0252294", "product_id": "product_en_0478038", "reviewer_id": "reviewer_en_0834256", "stars": "4", "review_body": "I expected them to be cheaply made but they were better than I thought they would be", "review_title": "Great for party hats", "language": "en", "product_category": "toy"}
{"review_id": "en_0204781", "product_id": "product_en_0440992", "reviewer_id": "reviewer_en_0098765", "stars": "4", "review_body": "Strap broke off both ends after 4 days of use. Updated The company sent me a replacement bigger right away. Unfortunately the handle broke off of the replacement bag within a few days as well. Updated The company has continued to be very responsive and continually works to ensure my problems have been solved. I have now received two replacement bags free of charge to ensure I received a good product.", "review_title": "Broke during first week but great custome service to fix issues", "language": "en", "product_category": "luggage"}
{"review_id": "en_0004739", "product_id": "product_en_0551446", "reviewer_id": "reviewer_en_0162146", "stars": "4", "review_body": "I got this for my daughter who has really long hair and wanted to try one instead of using a regular towel. She likes it because it's so simple to use.", "review_title": "Head towel", "language": "en", "product_category": "beauty"}
{"review_id": "en_0529152", "product_id": "product_en_0879438", "reviewer_id": "reviewer_en_0053660", "stars": "4", "review_body": "I have this light in my attic. It lights it up like it is daytime up there! The only big improvement I see is that I would like the arms to be able to flex upwards a bit to change the angle instead of being flat to inwards.", "review_title": "Crazy Bright Light", "language": "en", "product_category": "other"}
{"review_id": "en_0192510", "product_id": "product_en_0535086", "reviewer_id": "reviewer_en_0302518", "stars": "4", "review_body": "Very soft and comfortable, I have several pairs in other colors.", "review_title": "Soft", "language": "en", "product_category": "apparel"}
{"review_id": "en_0065504", "product_id": "product_en_0205240", "reviewer_id": "reviewer_en_0678003", "stars": "4", "review_body": "This is super cute and I have it on my patio door. It doesn’t exactly block the wind from coming in, but it does seem to eliminate the coldness of the door. Also cats.", "review_title": "Meow", "language": "en", "product_category": "home"}
{"review_id": "en_0498962", "product_id": "product_en_0720175", "reviewer_id": "reviewer_en_0541011", "stars": "4", "review_body": "Excellent colour and quality of material. Also very spacious and handy.", "review_title": "Backpack", "language": "en", "product_category": "shoes"}
{"review_id": "en_0139800", "product_id": "product_en_0867361", "reviewer_id": "reviewer_en_0681161", "stars": "4", "review_body": "Nice thin simple protection for my Macbook. Snaps on easily and keeps it from bumps and dings. Nice price for the case, too.", "review_title": "Simple, easy protection", "language": "en", "product_category": "pc"}
{"review_id": "en_0872700", "product_id": "product_en_0680205", "reviewer_id": "reviewer_en_0418143", "stars": "4", "review_body": "My kids love this! I wished I ordered two of this for my kids. They fight over using it all the time. They used it so much that it’s starting to squeak loudly every time they use it.", "review_title": "Such a fun toy for small kids, really good price", "language": "en", "product_category": "other"}
{"review_id": "en_0386253", "product_id": "product_en_0822497", "reviewer_id": "reviewer_en_0751245", "stars": "4", "review_body": "i have bought these shorts in multiple prints. they are so fun and the fabric is soft. i give the 4 stars instead of 5 because they do ride up a bit when you walk so i find myself tugging them frequently but i still love them. if i drop a few lbs maybe the ride up won't be an issue. i'll update the review if/when i drop the weight. LOL", "review_title": "so cute", "language": "en", "product_category": "apparel"}
{"review_id": "en_0352609", "product_id": "product_en_0202093", "reviewer_id": "reviewer_en_0051093", "stars": "4", "review_body": "This spinosaurus is solid, sturdy and heavy, looks very nice. lower jaw can move. only complaint is the teeth are a little fragile, some teeth fell off after playing with it for a few days.", "review_title": "solid, heavy, sturdy", "language": "en", "product_category": "toy"}
{"review_id": "en_0246854", "product_id": "product_en_0401203", "reviewer_id": "reviewer_en_0418969", "stars": "4", "review_body": "Best phone price - quality, it lags some times but nothing to worry about, the camera does not shoot good photos at low light and has no any kind of stabilization, everything else xiaomi did it just right", "review_title": "besides the camera, a cellphone you'd like to have", "language": "en", "product_category": "wireless"}
{"review_id": "en_0721580", "product_id": "product_en_0660125", "reviewer_id": "reviewer_en_0103897", "stars": "4", "review_body": "Looks awesome and made well. Looks movie quality. Would give 5 stars but it was slightly snug. Other than that it was perfect", "review_title": "Looks awesome and made well", "language": "en", "product_category": "toy"}
{"review_id": "en_0612609", "product_id": "product_en_0472359", "reviewer_id": "reviewer_en_0463319", "stars": "4", "review_body": "Filter looks and fit on car like the original one.", "review_title": "Four Stars", "language": "en", "product_category": "automotive"}
{"review_id": "en_0595664", "product_id": "product_en_0803805", "reviewer_id": "reviewer_en_0962385", "stars": "4", "review_body": "Very nice and fresh bold taste of the extra virgin olive oil from amazon itself. It's super in my bruschetta !!!", "review_title": "Awesome robust flavor great price and shipping.", "language": "en", "product_category": "other"}
{"review_id": "en_0032076", "product_id": "product_en_0012976", "reviewer_id": "reviewer_en_0760389", "stars": "4", "review_body": "Great puzzle. Well-made and sturdy. NIce bright colors that draw my toddler in. Plus, it has pegs that help him pick up and place each piece in its appropriate slot. Highly recommend it for home, classroom or as a gift!", "review_title": "Great puzzle. Well-made and sturdy", "language": "en", "product_category": "toy"}
{"review_id": "en_0202831", "product_id": "product_en_0792457", "reviewer_id": "reviewer_en_0847892", "stars": "4", "review_body": "I purchased these to use with my Instant Pot and they work well.", "review_title": "Four Stars", "language": "en", "product_category": "kitchen"}
{"review_id": "en_0004791", "product_id": "product_en_0336259", "reviewer_id": "reviewer_en_0573331", "stars": "4", "review_body": "The towel was a gift for my dear friend who loves it, it works great!!", "review_title": "Great", "language": "en", "product_category": "sports"}
{"review_id": "en_0460686", "product_id": "product_en_0169371", "reviewer_id": "reviewer_en_0433897", "stars": "4", "review_body": "This is wonderful for garlic. My only issue is that I thought it was made in Spain, but it dies nit say so, on the item.", "review_title": "Great Gadget", "language": "en", "product_category": "kitchen"}
{"review_id": "en_0816189", "product_id": "product_en_0732851", "reviewer_id": "reviewer_en_0699137", "stars": "4", "review_body": "The one I gave this as a gift to likes it. So, I am good with that:)", "review_title": "Looks simple and professional", "language": "en", "product_category": "apparel"}
{"review_id": "en_0074350", "product_id": "product_en_0421545", "reviewer_id": "reviewer_en_0513296", "stars": "4", "review_body": "I already broke the little guy under the vise by over tightening. So I made a new little guy for leverage. And also drilled and tapped a hole in the back for an eye bolt, for rotational lock up. I really like the vise and I would buy it again if I ever need two of them.", "review_title": "Hmmmm", "language": "en", "product_category": "other"}
{"review_id": "en_0131453", "product_id": "product_en_0942057", "reviewer_id": "reviewer_en_0477255", "stars": "4", "review_body": "This product does work however u have to bomb spray vacuum wash or nothing will work", "review_title": "Great price real results", "language": "en", "product_category": "industrial_supplies"}
{"review_id": "en_0302956", "product_id": "product_en_0774944", "reviewer_id": "reviewer_en_0037197", "stars": "4", "review_body": "The cover fits perfectly on my Garmin g10 GPS. It will help keep it protected from everyday use and possible damage.", "review_title": "They also send you three screen saves for added protection.", "language": "en", "product_category": "wireless"}
{"review_id": "en_0313183", "product_id": "product_en_0270364", "reviewer_id": "reviewer_en_0383961", "stars": "4", "review_body": "Returned. Would not fit on our type screen door.", "review_title": "Might not fit on all screen doors", "language": "en", "product_category": "home_improvement"}
{"review_id": "en_0501747", "product_id": "product_en_0881353", "reviewer_id": "reviewer_en_0129085", "stars": "4", "review_body": "Wasn't sure if this would fit properly on the Libman wet mop that we have, but these worked out really well.", "review_title": "Applicability", "language": "en", "product_category": "home"}
{"review_id": "en_0508751", "product_id": "product_en_0016441", "reviewer_id": "reviewer_en_0203781", "stars": "4", "review_body": "Good soap, specially for the price. Nothing too premium but great for maintenance washes with some wax in it.", "review_title": "Great maintenance soap", "language": "en", "product_category": "automotive"}
{"review_id": "en_0244807", "product_id": "product_en_0706753", "reviewer_id": "reviewer_en_0515060", "stars": "4", "review_body": "Pros: Bags are very full! Seems like they are made to last Has built in buckle to latch both bags together Con: rear bag doesnt hold the butt of the gun upright enough because its a shallow V shape instead of deep U Front bag is so wide doesnt help hold gun up just helps it be level All in all cant complain cuz i dont see any better alternatives at this pricepoint", "review_title": "Great deal, i guess", "language": "en", "product_category": "sports"}
{"review_id": "en_0349064", "product_id": "product_en_0951676", "reviewer_id": "reviewer_en_0797114", "stars": "4", "review_body": "So I was the drink holder was bigger. That is why I originally purchased this. There is also a spot for what looks like it would fit a credit card but it does NOT. Others I have seen since I bought this one, have a compartment for change. This one does not. However, on the plus size, it does prevent things falling in between the seat. I also found other uses for the \"drink holder\" part. Overall, I am happy since price was reasonable", "review_title": "good and not so good", "language": "en", "product_category": "automotive"}
{"review_id": "en_0298556", "product_id": "product_en_0892142", "reviewer_id": "reviewer_en_0113369", "stars": "4", "review_body": "Very pretty. Perfect in my daughter’s room. It is very lightweight & obviously inexpensive however.", "review_title": "Cute!", "language": "en", "product_category": "home"}
{"review_id": "en_0765872", "product_id": "product_en_0233534", "reviewer_id": "reviewer_en_0768418", "stars": "4", "review_body": "It definitely helps keep things tight and allows for longer play. It can be a little cumbersome to put on and takes more time than I thought it would. It will also cause a lot of sweat in the area it covers. Just washing it today so we will see if it holds up after wash.", "review_title": "It definitely helps keep things tight and allows for longer ...", "language": "en", "product_category": "drugstore"}
{"review_id": "en_0832485", "product_id": "product_en_0914143", "reviewer_id": "reviewer_en_0570167", "stars": "4", "review_body": "A different type of music from Keith but well done. Good featured artists.", "review_title": "Great album", "language": "en", "product_category": "other"}
{"review_id": "en_0594204", "product_id": "product_en_0795656", "reviewer_id": "reviewer_en_0723618", "stars": "4", "review_body": "Great Light & Useful for Photography, Auto Detailing & as a Replacement to Work Lights. The Stands are a bit cheesy but the remainder is very nice they are now my go to for all things garage related and photography. With a set of batteries they even make a great backup / portable work light!", "review_title": "Great Light & Useful for Photography, Auto Detailing & as a Replacement to Work Lights", "language": "en", "product_category": "camera"}
{"review_id": "en_0268879", "product_id": "product_en_0932540", "reviewer_id": "reviewer_en_0038070", "stars": "4", "review_body": "Great product. Not over soapy. Rinses quite well. Smell is natural and not overly pungent", "review_title": "You gotta try", "language": "en", "product_category": "beauty"}
{"review_id": "en_0839430", "product_id": "product_en_0859484", "reviewer_id": "reviewer_en_0233257", "stars": "4", "review_body": "Very easy to follow cookbook, but not much variety. Mostly taco recipes.", "review_title": "Limited Variety of Recipes", "language": "en", "product_category": "book"}
{"review_id": "en_0832802", "product_id": "product_en_0458743", "reviewer_id": "reviewer_en_0496021", "stars": "4", "review_body": "This is a very durable very secure door lock we like it alot the one downside would be there are no finger grips to help open this door lock once it is closed.", "review_title": "very secure", "language": "en", "product_category": "home_improvement"}
{"review_id": "en_0967094", "product_id": "product_en_0424354", "reviewer_id": "reviewer_en_0982172", "stars": "4", "review_body": "Works great but it’s dented not that I care that much.", "review_title": "Four Stars", "language": "en", "product_category": "kitchen"}
{"review_id": "en_0002599", "product_id": "product_en_0930875", "reviewer_id": "reviewer_en_0570276", "stars": "4", "review_body": "This is super cute. It has a drawstring under the chin to adjust to your dog’s head size. The tail piece is too small for my dog but he is missing the tip of his tail so the end of his tail is thick, not tapered. The mane probably won’t stay on for long but my dog won’t tolerate it for long anyway. I gave it 4 stars because it’s not as fuzzy as the main picture would have you think.", "review_title": "Very cute and fun.", "language": "en", "product_category": "pet_products"}
{"review_id": "en_0997521", "product_id": "product_en_0683561", "reviewer_id": "reviewer_en_0538389", "stars": "4", "review_body": "Works great once I figured out how to configure my new TV to switch to optical audio out.", "review_title": "Four Stars", "language": "en", "product_category": "pc"}
{"review_id": "en_0356805", "product_id": "product_en_0210717", "reviewer_id": "reviewer_en_0445973", "stars": "4", "review_body": "Did a great job on my neck", "review_title": "Massage", "language": "en", "product_category": "drugstore"}
{"review_id": "en_0198222", "product_id": "product_en_0924289", "reviewer_id": "reviewer_en_0960773", "stars": "4", "review_body": "arrived quickly, great color goes with everything", "review_title": "great color goes with", "language": "en", "product_category": "apparel"}
{"review_id": "en_0751802", "product_id": "product_en_0404682", "reviewer_id": "reviewer_en_0548094", "stars": "4", "review_body": "I puchased this for use as a tick repellent for my dogs, and it smells good, so I use it as well.", "review_title": "Smells wonderful", "language": "en", "product_category": "beauty"}
{"review_id": "en_0463925", "product_id": "product_en_0781445", "reviewer_id": "reviewer_en_0755357", "stars": "4", "review_body": "Not as good as the old US made files, but perfectly acceptable quality. I would purchase again.", "review_title": "Good/Acceptable Quality", "language": "en", "product_category": "beauty"}
{"review_id": "en_0828651", "product_id": "product_en_0795045", "reviewer_id": "reviewer_en_0233966", "stars": "4", "review_body": "nice video and sound", "review_title": "Four Stars", "language": "en", "product_category": "other"}
{"review_id": "en_0525497", "product_id": "product_en_0552283", "reviewer_id": "reviewer_en_0142583", "stars": "4", "review_body": "This is a great game especially if you enjoy Cards Against Humanity. My only complaint is that we seemed to have duplicate cards which I think it would have been more fun given something new and different each hand.", "review_title": "So Much Fun", "language": "en", "product_category": "toy"}
{"review_id": "en_0096068", "product_id": "product_en_0004097", "reviewer_id": "reviewer_en_0335928", "stars": "4", "review_body": "Not as good as the stuff with silicone but probably one of the best water based I've had", "review_title": "Not quite as good as silicone", "language": "en", "product_category": "drugstore"}
{"review_id": "en_0744215", "product_id": "product_en_0899045", "reviewer_id": "reviewer_en_0377466", "stars": "4", "review_body": "Its not AS nice as it is in the picture but it is still cute", "review_title": "Four Stars", "language": "en", "product_category": "apparel"}
{"review_id": "en_0071185", "product_id": "product_en_0109835", "reviewer_id": "reviewer_en_0666985", "stars": "4", "review_body": "does not transfer at easily as some vinyls but it’s still really good!", "review_title": "transfer not as good", "language": "en", "product_category": "home"}
{"review_id": "en_0186380", "product_id": "product_en_0675110", "reviewer_id": "reviewer_en_0550292", "stars": "4", "review_body": "I've only been using this product for about a month, so I can't say that this has helped me get pregnant yet, but I can say that my cycle has definitely changed since using this product.", "review_title": "Good Product", "language": "en", "product_category": "drugstore"}
{"review_id": "en_0750008", "product_id": "product_en_0995727", "reviewer_id": "reviewer_en_0671608", "stars": "4", "review_body": "Very pretty. Adjustable chain size is a plus, but lace could be longer to surround back of neck a bit more.", "review_title": "Very pretty necklace, but not too \"sugary sweet\"!", "language": "en", "product_category": "jewelry"}
{"review_id": "en_0478687", "product_id": "product_en_0027522", "reviewer_id": "reviewer_en_0181245", "stars": "4", "review_body": "I was scared to order another whip. I had a couple in the past there where terrible lasted maybe one ride out. The moment this whip came to the house i knew it was very high quality. this whip is very solid i am very happy. I was so excited when i installed it i forgot it was still on and i went into my garage and it racked over my garage door. i was scared it broke it. I was able to get it off. It didn't even have a scratch on it. I bent it in half and no worries at all. I can not be more happy with it. also A few days after it was delivered there customer service contacted me to make sure everything was in order. My only complaint is the wiring harness is a little short. I wired it to a toggle switch it barely made it. was not able to make a super clean install. still not a deal breaker.", "review_title": "superb product", "language": "en", "product_category": "automotive"}
{"review_id": "en_0692063", "product_id": "product_en_0516025", "reviewer_id": "reviewer_en_0330953", "stars": "4", "review_body": "Seems to be decent quality and holds my phone well while watching Netflix. Could be a few inches shorter for storage but I am use to it now. This item is as described.", "review_title": "Nice for the money", "language": "en", "product_category": "wireless"}
{"review_id": "en_0928617", "product_id": "product_en_0961970", "reviewer_id": "reviewer_en_0865113", "stars": "4", "review_body": "Really is a well built product overall. Only wish that the velcro pad on back side was larger and the actual pad size was larger.", "review_title": "Very Good!", "language": "en", "product_category": "beauty"}
{"review_id": "en_0048621", "product_id": "product_en_0197377", "reviewer_id": "reviewer_en_0171941", "stars": "4", "review_body": "Good curtain but 4 stars because the rings are cheap and flimsy.", "review_title": "Four Stars", "language": "en", "product_category": "home"}
{"review_id": "en_0234746", "product_id": "product_en_0190973", "reviewer_id": "reviewer_en_0944971", "stars": "4", "review_body": "Good value until you realize that they’re all small measurement cups. I do mean “small”!", "review_title": "Good value", "language": "en", "product_category": "other"}
{"review_id": "en_0852044", "product_id": "product_en_0384036", "reviewer_id": "reviewer_en_0851769", "stars": "4", "review_body": "Fit was kind of large", "review_title": "Four Stars", "language": "en", "product_category": "industrial_supplies"}
{"review_id": "en_0584543", "product_id": "product_en_0150556", "reviewer_id": "reviewer_en_0729460", "stars": "4", "review_body": "I love this game, but I am playing on a tablet and it kicks me out can you please fix this bug", "review_title": "Not Working", "language": "en", "product_category": "other"}
{"review_id": "en_0936765", "product_id": "product_en_0921842", "reviewer_id": "reviewer_en_0127288", "stars": "4", "review_body": "Awesome tote but mine came with the paw print upside-down. Sending back, which is annoying to have to do.", "review_title": "Good tote", "language": "en", "product_category": "pet_products"}
{"review_id": "en_0078977", "product_id": "product_en_0647348", "reviewer_id": "reviewer_en_0331672", "stars": "4", "review_body": "After reading some reviews I was skeptical about which size to order & I went with the 18-20 just in case because I have wide hips & some booty & I'm 7 months pregnant. They fit & actually could be little more snug & they'd be perfect. All & all I'm pretty satisfied. They're pretty light & definitely not going to be hot on me for the rest of this awful hot & humid summer in the South :)", "review_title": "Nice fit with growing room", "language": "en", "product_category": "apparel"}
{"review_id": "en_0623057", "product_id": "product_en_0710822", "reviewer_id": "reviewer_en_0481861", "stars": "4", "review_body": "This works well, only issue is that it’s a little bit heavy", "review_title": "This works well, only issue is that it’s a little bit heavy", "language": "en", "product_category": "wireless"}
{"review_id": "en_0231878", "product_id": "product_en_0518365", "reviewer_id": "reviewer_en_0281564", "stars": "4", "review_body": "I think the manufacturers are from France. French writing on the cover.", "review_title": "Four Stars", "language": "en", "product_category": "other"}
{"review_id": "en_0591817", "product_id": "product_en_0975916", "reviewer_id": "reviewer_en_0176720", "stars": "4", "review_body": "All tested and working properly upon arrival, seem to be just what I was looking for.", "review_title": "Four Stars", "language": "en", "product_category": "toy"}
{"review_id": "en_0975885", "product_id": "product_en_0193732", "reviewer_id": "reviewer_en_0492101", "stars": "4", "review_body": "Got in mail to-day. Very quick ship. Arrived with charge in it so that was good. Flashlight works, gives a good spark, nice and noisy, bought it for dogs on my walk. Go on a walk with my new stun gun, and a neighbor down the road was working on his car and forgot to close the gate and his pit bull ran out at me. It was in my pocket and I was not ready, but got it out, sparked it and pitty the pit bull backed off. Of course the owner also called it off, so not really a good test, but dog did look a little perturbed when it was noisily sparking. Taught me a lesson: If dogs in area have it 'ON' and in the hand while walking. In the pocket and turned off cost me time, because I was fumbling to get it out. That dog came quick. The alarm is not ear piecing, it's okay, nothing to write home about. It's well made, the price is right, so I'm very happy with it. Would recommend.", "review_title": "Is it any good?", "language": "en", "product_category": "sports"}
{"review_id": "en_0703893", "product_id": "product_en_0124910", "reviewer_id": "reviewer_en_0492988", "stars": "4", "review_body": "First I received the wrong product, but the customer service was stellar and prompt. I like this chair and would order from this seller again", "review_title": "Good product and good customer service", "language": "en", "product_category": "furniture"}
{"review_id": "en_0595550", "product_id": "product_en_0667246", "reviewer_id": "reviewer_en_0309925", "stars": "4", "review_body": "Had to return the 1st one because it broke. Replacement is fine.", "review_title": "Nice teal shower flooring for our boat.", "language": "en", "product_category": "home"}
{"review_id": "en_0302654", "product_id": "product_en_0379939", "reviewer_id": "reviewer_en_0408871", "stars": "4", "review_body": "The hat is nice, but the knit is too tight for the hat to show any sign of looking like it is a slouch hat!", "review_title": "Nice but not slouchy.", "language": "en", "product_category": "apparel"}
{"review_id": "en_0715238", "product_id": "product_en_0466366", "reviewer_id": "reviewer_en_0561696", "stars": "4", "review_body": "These have an off and on switch which allows me to listen to calls via my pc. I connect my headset to it via USB and when I want to speak via my pc, I switch it to on and then I can talk. Would have given it 5 stars if the cable was a little longer.", "review_title": "Excellent Adapter With On/Off Switch", "language": "en", "product_category": "pc"}
{"review_id": "en_0446508", "product_id": "product_en_0017081", "reviewer_id": "reviewer_en_0043515", "stars": "4", "review_body": "I would purchase again.", "review_title": "Definitely try it out.", "language": "en", "product_category": "drugstore"}
{"review_id": "en_0354312", "product_id": "product_en_0700271", "reviewer_id": "reviewer_en_0429453", "stars": "4", "review_body": "I got one of these back when they first started gaining popularity. I will say that this is by far the best protection for your ankle. I had a damaged ankle when I started trying out for professional soccer teams and I was wearing one of these the entire time. I ended up getting picked up and was able to play in Sweden. This brace went above and beyond to protect my ankle so I could achieve my dream. My ankle did end up blowing out when I kicked the ball at the same time as another player that came from the side of me, but it was a ticking time bomb anyway and nothing in the world would have prevented that. The only reason I don't give it a 5 star is because it seems like the velcro has changed. Back when I got my first one, the velcro stuck very strong and it would never come loose. I just purchased two new ones and the velcro straps are always coming undone.", "review_title": "Best ankle protection but needs stronger velcro", "language": "en", "product_category": "sports"}
{"review_id": "en_0451353", "product_id": "product_en_0530153", "reviewer_id": "reviewer_en_0508966", "stars": "4", "review_body": "I bought two sets of these to fill six empty ear piercings. Overall, I’m happy. They are very pretty, and they match my more expensive white opal jewelry. Packaging: each set comes in its own small plastic bag sealed with an adhesive strip. There was nothing holding the individual pieces in place, but at least the balls were all screwed on. Luckily, there was no scratches on the material. Putting them in: difficult. One of the balls was stuck on and I couldn’t get it to budge at first. I almost considered returning one set but I was able to get t off after about 10 minutes of trying. Putting them in was challenging because I can’t see behind my ear of course. I’ve been wearing them for a couple weeks now, and I am still pleased. I have very sensitive skin, and I’ve experienced no irritation. The balls have not loosened, and the jewels still fit securely in their settings. I originally wanted to get real white gold jewelry, but I’m not sure I’ll need to anytime soon.", "review_title": "Pretty!", "language": "en", "product_category": "jewelry"}
{"review_id": "en_0197327", "product_id": "product_en_0719015", "reviewer_id": "reviewer_en_0581601", "stars": "4", "review_body": "So I just got this serum, I really love it mixing with my lotion of the same brand, the only thing I don’t appreciate is the bottle.. it’s so hard to get the serum out.. I wish they can do sumthin about their packaging bcoz this is frustrating if you like me wanting to mix in other body lotions .. gettin it out is a struggle", "review_title": "The packaging", "language": "en", "product_category": "beauty"}
{"review_id": "en_0492661", "product_id": "product_en_0289858", "reviewer_id": "reviewer_en_0706253", "stars": "4", "review_body": "The best thing about these phones is the Bluetooth stays solidly connected to my Apple Watch. Unlike some other earbuds I’ve tried, these don’t skip at all. I’ve had no issues with the battery life... I’ve never had them run out while I’m using them. Sound quality... not great. The bass response is poor. It’s slightly better if you can keep the buds firmly inserted in your ear canal, but they seem to work their way out of the ear. They don’t fall off, but they back out. I think this is partially due to the small rubber tab that helps retain them to the outer ear. It’s angled slightly inward (toward the head), and this may put a tiny bit of pressure that gradually pulls the buds out as that rubber tab straightens itself.", "review_title": "Solid Bluetooth Connection to Apple Watch, mediocre sound.", "language": "en", "product_category": "wireless"}
{"review_id": "en_0320262", "product_id": "product_en_0959645", "reviewer_id": "reviewer_en_0992752", "stars": "4", "review_body": "This item is very helpful.", "review_title": "Love it", "language": "en", "product_category": "wireless"}
{"review_id": "en_0087652", "product_id": "product_en_0172932", "reviewer_id": "reviewer_en_0667638", "stars": "4", "review_body": "The product works just as it was described. But I do find some of the lids don’t stay closed. Would love to be able to purchase some replacements", "review_title": "Works exactly as expected! Would Recommend to anyone!", "language": "en", "product_category": "drugstore"}
{"review_id": "en_0696375", "product_id": "product_en_0619427", "reviewer_id": "reviewer_en_0837299", "stars": "4", "review_body": "This is a little confusing at first, but once you get it all set up, it's great. Only thing that I would recommend to extend battery life would be to get rid of display on the wireless sensors. Other than that, exactly what I was looking for.", "review_title": "Awesome thermometer, good price, battery life just ok.", "language": "en", "product_category": "lawn_and_garden"}
{"review_id": "en_0983717", "product_id": "product_en_0628891", "reviewer_id": "reviewer_en_0814969", "stars": "4", "review_body": "works great - just wish it had netting on the front also", "review_title": "Great cart", "language": "en", "product_category": "other"}
{"review_id": "en_0262962", "product_id": "product_en_0599826", "reviewer_id": "reviewer_en_0149348", "stars": "4", "review_body": "Very pretty, but smaller than I had thought.", "review_title": "Bright Christmas", "language": "en", "product_category": "lawn_and_garden"}
{"review_id": "en_0960261", "product_id": "product_en_0778882", "reviewer_id": "reviewer_en_0560959", "stars": "4", "review_body": "It was for kids tablets and they like them but they need a better stand when you fold the back down. It just doesn’t work well but otherwise great product.", "review_title": "It was for kids tablets and they like them but they need a better stand when you ...", "language": "en", "product_category": "other"}
{"review_id": "en_0662236", "product_id": "product_en_0599635", "reviewer_id": "reviewer_en_0353412", "stars": "4", "review_body": "I really like this product for out the lake . We now have six , not saying they are in good shape. NOT but usable until the last 2. They are nice style because I like to have the control. Pros and cons ... but no horse playing. The last 2 however the seams are coming apart already and we have not spent much time on them. . I have that many as if company the are great to sit and talk with your yeti. They do fade quickly but we we do keep them on the boat and sun kits them. I have to be re sewing them several times. But think now have to pitch they are torn & threaded and beyond repair. And as others say line inner tube Line up before adding air. If I get a years out of 2 I’m happy. Also I hate plastic and fabric cover is so much nicer. To the Company please do more stitching and maybe heavier material closer sewn & if the bottom material was little thicker it last longer. I do like just up grade. We will pay extra for quality to last longer. Going to have to sew my new 2 , Sadly already May just been flaws idk. But those are disappointing. But I continue to order until I find a similar style better quality and husband wold like his little larger. These work ... Pass return time now. An I do like loop on back so you can tie off to the boat if water is high or you don’t want to drift to far. Or get off and don’t have to pull in boat each time.when you go back in the water. But honestly they look well made I thought we put to much air in but we did not. Not our first we are careful Wish they replace. Or go on sales it’s prime day as I was looking for a sale. Didn’t take last 2 out until the season. They are priced ok but . Let me enjoy a season.", "review_title": "Nice seat pro & cons", "language": "en", "product_category": "lawn_and_garden"}
{"review_id": "en_0409094", "product_id": "product_en_0066113", "reviewer_id": "reviewer_en_0362177", "stars": "4", "review_body": "we put these rugs in the front of our tent they work great collecting all the dirt so it does not get into the tent.", "review_title": "it works", "language": "en", "product_category": "furniture"}
{"review_id": "en_0440959", "product_id": "product_en_0438542", "reviewer_id": "reviewer_en_0514577", "stars": "4", "review_body": "This one a good read. I started to read it and thought I wasn't for me but the more I read the more I get into it.", "review_title": "Was a good story", "language": "en", "product_category": "digital_ebook_purchase"}
{"review_id": "en_0218371", "product_id": "product_en_0147067", "reviewer_id": "reviewer_en_0285099", "stars": "4", "review_body": "Very soft, kind of cheap - but good for the price.", "review_title": "kind of cheap - but good for the price", "language": "en", "product_category": "apparel"}
{"review_id": "en_0312812", "product_id": "product_en_0049229", "reviewer_id": "reviewer_en_0916344", "stars": "4", "review_body": "I've never owned really expensive hiking poles, but I honestly can see what they would have or do that these don't.", "review_title": "Great Hiking Pole for the money", "language": "en", "product_category": "other"}
{"review_id": "en_0635726", "product_id": "product_en_0208131", "reviewer_id": "reviewer_en_0035503", "stars": "4", "review_body": "I love these, the colors are great and they greatly reduce my makeup application time over powder eyeshadows! I only gave it 4 stars because I ordered both sets (bright and soft) and got two of the soft colors, none of the bright colors. Side note,, you can use these along wit eyeshadow to make some pretty creative looks.", "review_title": "Great colors and reduces makeup application time!", "language": "en", "product_category": "beauty"}
{"review_id": "en_0247280", "product_id": "product_en_0386094", "reviewer_id": "reviewer_en_0898616", "stars": "4", "review_body": "Fits and works great", "review_title": "I like it", "language": "en", "product_category": "sports"}
{"review_id": "en_0290392", "product_id": "product_en_0771771", "reviewer_id": "reviewer_en_0556469", "stars": "4", "review_body": "The shakers are really cute but a little bigger then I imagined. No issues with salt and pepper spilling from the seams. After a week of adjusting to the size I absolutely love them. Really good price quality for the price.", "review_title": "Super cute but a little big!", "language": "en", "product_category": "kitchen"}
{"review_id": "en_0126839", "product_id": "product_en_0204943", "reviewer_id": "reviewer_en_0782397", "stars": "4", "review_body": "I am not sure how I feel about the mixed colors..they kind of make it hard to color nicely..some of the colors don't go together well", "review_title": "they kind of make it hard to color nicely.. some of the colors don't go together", "language": "en", "product_category": "toy"}
{"review_id": "en_0755865", "product_id": "product_en_0637160", "reviewer_id": "reviewer_en_0226824", "stars": "4", "review_body": "I really like these capris. I ordered three. I work out in them and because they don't look like workout capris, I can wear them with a long tunic and the whole outfit looks very nice.", "review_title": "I really like these capris", "language": "en", "product_category": "sports"}
{"review_id": "en_0637110", "product_id": "product_en_0262933", "reviewer_id": "reviewer_en_0341663", "stars": "4", "review_body": "Really pretty ring, not had it long enough to say if it will wear well or not", "review_title": "Four Stars", "language": "en", "product_category": "jewelry"}
{"review_id": "en_0996980", "product_id": "product_en_0537021", "reviewer_id": "reviewer_en_0733527", "stars": "4", "review_body": "Somewhat of a slow start but a very good read, regardless. I had a really hard time putting the book down towards the end when the plot really changes. Definitely a good book!", "review_title": "Very good!", "language": "en", "product_category": "digital_ebook_purchase"}
{"review_id": "en_0610004", "product_id": "product_en_0528474", "reviewer_id": "reviewer_en_0733786", "stars": "4", "review_body": "Was not an exact match with my generator however it works fine and I am satisfied.", "review_title": "... an exact match with my generator however it works fine and I am satisfied", "language": "en", "product_category": "lawn_and_garden"}
{"review_id": "en_0516456", "product_id": "product_en_0456951", "reviewer_id": "reviewer_en_0407727", "stars": "4", "review_body": "Somewhat predictable, but still an interesting read.", "review_title": "Four Stars", "language": "en", "product_category": "digital_ebook_purchase"}
{"review_id": "en_0467819", "product_id": "product_en_0372741", "reviewer_id": "reviewer_en_0431614", "stars": "4", "review_body": "Works good kinda thick but if they aren’t cold they will work fine", "review_title": "Ok", "language": "en", "product_category": "beauty"}
{"review_id": "en_0522244", "product_id": "product_en_0134530", "reviewer_id": "reviewer_en_0836615", "stars": "4", "review_body": "It’s great and sturdy. I’ve dropped my iPad once with this cover and it didn’t pop out so it’s really durable to me. I don’t like how it barely fits in the groove though and the slightest movement will make my iPad collapse down. :/ other than that’s its a great product", "review_title": "Great product", "language": "en", "product_category": "wireless"}
{"review_id": "en_0553163", "product_id": "product_en_0427154", "reviewer_id": "reviewer_en_0413908", "stars": "4", "review_body": "Had for like 2 years and it’s great but started falling apart after a good year or so, would buy again!", "review_title": "Great product overall for the money!!!", "language": "en", "product_category": "pc"}
{"review_id": "en_0605253", "product_id": "product_en_0956227", "reviewer_id": "reviewer_en_0454838", "stars": "4", "review_body": "Colorful, educational. Sticks to the sides of the tub for learning and pointing out for little ones. I just wish there were more of an assortment. My grandson does enjoy playing with them and he is only 2 and can identify these ocean animals by sight now.", "review_title": "Educational, colorful, cute", "language": "en", "product_category": "baby_product"}
{"review_id": "en_0923495", "product_id": "product_en_0983380", "reviewer_id": "reviewer_en_0789434", "stars": "4", "review_body": "I used this on my bed as a cover for my mattress under my fitted sheet and I love it it has deep pockets so it doesn’t slip of my mattress constantly", "review_title": "Great deal", "language": "en", "product_category": "home"}
{"review_id": "en_0774784", "product_id": "product_en_0713829", "reviewer_id": "reviewer_en_0880874", "stars": "4", "review_body": "Really cute and comfy!!", "review_title": "Soft, velvety and sexy", "language": "en", "product_category": "apparel"}
{"review_id": "en_0276310", "product_id": "product_en_0807208", "reviewer_id": "reviewer_en_0608089", "stars": "4", "review_body": "Easy and straightforward does the job.", "review_title": "10 minutes job.", "language": "en", "product_category": "automotive"}
{"review_id": "en_0533147", "product_id": "product_en_0654864", "reviewer_id": "reviewer_en_0452224", "stars": "4", "review_body": "I liked everything about the engagement calendar, but think the paper is thinner than it used to be.", "review_title": "Good organizational product", "language": "en", "product_category": "book"}
{"review_id": "en_0042251", "product_id": "product_en_0007485", "reviewer_id": "reviewer_en_0546267", "stars": "4", "review_body": "Very nice looks pretty", "review_title": "Four Stars", "language": "en", "product_category": "home"}
{"review_id": "en_0982360", "product_id": "product_en_0861474", "reviewer_id": "reviewer_en_0953333", "stars": "4", "review_body": "everything is good all over fast delivery except, equality and the size the fabric too thin and size you should order two sizes larger than what you required", "review_title": "Not bad but..! Fast delivery", "language": "en", "product_category": "lawn_and_garden"}
{"review_id": "en_0043196", "product_id": "product_en_0761763", "reviewer_id": "reviewer_en_0348703", "stars": "4", "review_body": "Taste isnt the greatest but what vitamin is. I dont take any vitamin or medicine without food or drink anyway. So as long as you do that then your fine. I actually bought for this my pregnant daughter. She agrees with this review. I like the fact that they have iron in them which my vitamins dont. So thats a plus right there for me and just about any pregnant woman.", "review_title": "Prenatal vitamins", "language": "en", "product_category": "drugstore"}
{"review_id": "en_0791323", "product_id": "product_en_0085879", "reviewer_id": "reviewer_en_0993530", "stars": "4", "review_body": "This was a simply written. There was enough discription of each charactor. There were a lot of characters that you had to keep straight through out the book. The story centered around a group of retired SWAT team officers and invading China and North Korean armies. There was a little bit of the story dealing with and history of how and why their was an invasion, not more about anything further. The editor and proof reader needed to spend more time reviewing the book, alot of missing words through the story. So I'm wondering if Mr. Moore will continue the story.", "review_title": "Simple Read", "language": "en", "product_category": "digital_ebook_purchase"}
{"review_id": "en_0266123", "product_id": "product_en_0595532", "reviewer_id": "reviewer_en_0623785", "stars": "4", "review_body": "Book came just as described. Sentences for my daughter to finish and personalize. Only gave 4 stars because only 1 cover design available", "review_title": "Awesome gift for dads", "language": "en", "product_category": "book"}
{"review_id": "en_0929288", "product_id": "product_en_0360812", "reviewer_id": "reviewer_en_0119151", "stars": "4", "review_body": "It works really good", "review_title": "Works grate", "language": "en", "product_category": "kitchen"}
{"review_id": "en_0683625", "product_id": "product_en_0265069", "reviewer_id": "reviewer_en_0358492", "stars": "4", "review_body": "It's not as bubbly as the other Shea moisture baby wash, so I prefer the other one.", "review_title": "Less bubbles", "language": "en", "product_category": "beauty"}
{"review_id": "en_0766197", "product_id": "product_en_0788514", "reviewer_id": "reviewer_en_0172427", "stars": "4", "review_body": "The enter key is alittle small but you adjust to it eventually. for the price it's a good deal. the enter key needs to be bigger and hopefully in the future not as loud.", "review_title": "Keyboard is mechanical and kinda louder than a normal keybaord but the feel of the keys are good.", "language": "en", "product_category": "pc"}
{"review_id": "en_0252325", "product_id": "product_en_0886308", "reviewer_id": "reviewer_en_0106277", "stars": "4", "review_body": "The ergonomics or design of this product made it impossible to use. It fit on the back of my tv where the USB port is snug between two other outlet jacks and it is impossible to fit this product there because it’s outlet prevents plugging it in right above another jack. This design prevented me from using this device which seems well-made.", "review_title": "Not the right product for my situation", "language": "en", "product_category": "pc"}
{"review_id": "en_0905730", "product_id": "product_en_0583665", "reviewer_id": "reviewer_en_0810417", "stars": "4", "review_body": "I have been using this product for the past 5 days and it seems to work to an extent.", "review_title": "It whitens to an extent", "language": "en", "product_category": "beauty"}
{"review_id": "en_0020294", "product_id": "product_en_0597008", "reviewer_id": "reviewer_en_0863147", "stars": "4", "review_body": "This works really well, but you do have to turn the cob over and it's not always easy to get it aligned, but works perfect for my daughter who likes corn but not on the cob, and my elderly father who doesn't have the bite anymore to eat corn on the cob. Quickly shipped also.", "review_title": "but you do have to turn the cob over and it's not always easy to get it aligned", "language": "en", "product_category": "kitchen"}
{"review_id": "en_0106406", "product_id": "product_en_0653334", "reviewer_id": "reviewer_en_0607365", "stars": "4", "review_body": "Very well made and easy to pop on and off. Four stars because it sits pretty high up in the middle making it hard for my son to use on his own.", "review_title": "Very well made and easy to pop on and off", "language": "en", "product_category": "baby_product"}
{"review_id": "en_0252493", "product_id": "product_en_0716136", "reviewer_id": "reviewer_en_0556031", "stars": "4", "review_body": "My 3 month old peed alllll over it, and it all stayed on the pad. It's on the small side. So I say it's great for new babies, and can handle everything little babies throw at it. I will likely upgrade to larger pads in the next few months.", "review_title": "Great for newborn babies.", "language": "en", "product_category": "baby_product"}
{"review_id": "en_0929283", "product_id": "product_en_0127430", "reviewer_id": "reviewer_en_0219754", "stars": "4", "review_body": "Nice wallet. One of the zippers is a little tough to open and close.", "review_title": "Nice wallet.", "language": "en", "product_category": "luggage"}
{"review_id": "en_0276832", "product_id": "product_en_0607368", "reviewer_id": "reviewer_en_0431104", "stars": "4", "review_body": "It's a mat for working out that works as it should. Makes my workouts on my hardwood floors much easier.", "review_title": "It's a mat for working out that works as it ...", "language": "en", "product_category": "sports"}
{"review_id": "en_0735307", "product_id": "product_en_0226060", "reviewer_id": "reviewer_en_0315901", "stars": "4", "review_body": "It looks good, but not really to assemble.", "review_title": "Good to buy for your office", "language": "en", "product_category": "furniture"}
{"review_id": "en_0607039", "product_id": "product_en_0135056", "reviewer_id": "reviewer_en_0523034", "stars": "4", "review_body": "Great product I have it in the grille so it’s not as bright as I wanted but it works perfect", "review_title": "Would but again", "language": "en", "product_category": "automotive"}
{"review_id": "en_0060200", "product_id": "product_en_0272732", "reviewer_id": "reviewer_en_0319469", "stars": "4", "review_body": "Avid fan, was please with my purchase.", "review_title": "Liverpool Merchandise", "language": "en", "product_category": "apparel"}
{"review_id": "en_0625081", "product_id": "product_en_0440123", "reviewer_id": "reviewer_en_0562815", "stars": "4", "review_body": "I would have given 5 stars if they didn’t frey, but super soft and great for my little newborn. I will be buying more", "review_title": "but super soft and great for my little newborn", "language": "en", "product_category": "baby_product"}
{"review_id": "en_0685234", "product_id": "product_en_0099688", "reviewer_id": "reviewer_en_0657267", "stars": "4", "review_body": "It’s hard to find a cane with this handle configuration. It gives you a comfortable handle with center of gravity straight above the shaft of the cane itself.", "review_title": "Centered handle cane", "language": "en", "product_category": "drugstore"}
{"review_id": "en_0672356", "product_id": "product_en_0333140", "reviewer_id": "reviewer_en_0116283", "stars": "4", "review_body": "Great price just because of color", "review_title": "Four Stars", "language": "en", "product_category": "other"}
{"review_id": "en_0615731", "product_id": "product_en_0946943", "reviewer_id": "reviewer_en_0452850", "stars": "4", "review_body": "My note 8 always runs out of battery, as I use on Qhd display while using my phone. This case comes in handy as I can use my phone while it is charging. It has two functionalities. 1. Battery case. 2. Power bank. This case be turned on and off by clicking on the button behind the case. It's a bit bulky to hold on to. But it's useful when you really are out of juice and travelling.", "review_title": "Two way functionality", "language": "en", "product_category": "wireless"}
{"review_id": "en_0353613", "product_id": "product_en_0499452", "reviewer_id": "reviewer_en_0710111", "stars": "4", "review_body": "great to neat'n up computer Desk.", "review_title": "Four Stars", "language": "en", "product_category": "electronics"}
{"review_id": "en_0261817", "product_id": "product_en_0427231", "reviewer_id": "reviewer_en_0662102", "stars": "4", "review_body": "I really like this product. It’s easy to use and works very well.", "review_title": "Easy to use.", "language": "en", "product_category": "automotive"}
{"review_id": "en_0381014", "product_id": "product_en_0776019", "reviewer_id": "reviewer_en_0527889", "stars": "4", "review_body": "Good book, I enjoyed reading it.", "review_title": "Four Stars", "language": "en", "product_category": "digital_ebook_purchase"}
{"review_id": "en_0383806", "product_id": "product_en_0481850", "reviewer_id": "reviewer_en_0261803", "stars": "4", "review_body": "Very nice a good flow for putting out the medicine . Very quiet machine..Being used daily works great...will order another", "review_title": "Quiet, small, got power", "language": "en", "product_category": "drugstore"}
{"review_id": "en_0350866", "product_id": "product_en_0736143", "reviewer_id": "reviewer_en_0684330", "stars": "4", "review_body": "Unless I have a special G8, this has a couple of extra features that don't seem to fit the phone: - extra button cover on the left side, which makes 3 buttons, my G8 has only the volume up/down buttons there - two extra holes on the right side, toward the bottom which expose nothing bu the phone case I guess that's what \"compatible\" means, not perfect fit, but will work fine :-) The main purpose of the case is however achieved: stopping this darn phone from sliding on any surface that is not perfectly horizontal!", "review_title": "Fits LG G8 just fine, but...", "language": "en", "product_category": "wireless"}
{"review_id": "en_0246247", "product_id": "product_en_0516730", "reviewer_id": "reviewer_en_0822895", "stars": "4", "review_body": "Neck is lower than picture probably because of weight of this stretch knit but launders well.", "review_title": "Great for maternity too.", "language": "en", "product_category": "apparel"}
{"review_id": "en_0919880", "product_id": "product_en_0931397", "reviewer_id": "reviewer_en_0406338", "stars": "4", "review_body": "Not great if your are at the river and walking on rocks. They get stuck in the bottom. The bottom is a little thin too, so not as comfortable as I originally thought. They are lightweight and easy to put on.", "review_title": "Not great if your are at the river and walking on ...", "language": "en", "product_category": "shoes"}
{"review_id": "en_0678823", "product_id": "product_en_0974671", "reviewer_id": "reviewer_en_0556997", "stars": "4", "review_body": "This shoes is very comfortable", "review_title": "Comfortable shoes", "language": "en", "product_category": "shoes"}
{"review_id": "en_0169269", "product_id": "product_en_0909291", "reviewer_id": "reviewer_en_0228364", "stars": "4", "review_body": "Love the vintage/noir feel! Very Interesting and different cinematic approach from scene to scene. Cinematography was beautiful! Very enjoyable.", "review_title": "Four Stars", "language": "en", "product_category": "digital_video_download"}
{"review_id": "en_0214029", "product_id": "product_en_0603183", "reviewer_id": "reviewer_en_0621046", "stars": "4", "review_body": "Thin polyester printed exactly as it looks in this pic! Lightweight no China smell, no texture really", "review_title": "Thin polyester printed exactly", "language": "en", "product_category": "apparel"}
{"review_id": "en_0347041", "product_id": "product_en_0705479", "reviewer_id": "reviewer_en_0676988", "stars": "4", "review_body": "Not as pictured as far as flavors or colors are shown. There are only red, orange green and yellow. None of the good colors or flavors. They work well.", "review_title": "Gummies", "language": "en", "product_category": "drugstore"}
{"review_id": "en_0721308", "product_id": "product_en_0598176", "reviewer_id": "reviewer_en_0225324", "stars": "4", "review_body": "I ordered the blueish gray color and it's really pretty. I decided to give the dress to my mom since she loves cold-shoulder. It's a basic dress, can't go wrong with it. I wish it was slightly more form fitting, but it looks good on my mom!", "review_title": "IRON it first and then pass judgment", "language": "en", "product_category": "apparel"}
{"review_id": "en_0417112", "product_id": "product_en_0536890", "reviewer_id": "reviewer_en_0342066", "stars": "4", "review_body": "Adorable, durable and fits well for the price. My 3 year old daughter loves it!", "review_title": "Durable, fits well for the price !", "language": "en", "product_category": "apparel"}
{"review_id": "en_0237503", "product_id": "product_en_0708885", "reviewer_id": "reviewer_en_0836540", "stars": "4", "review_body": "Happy with quality of product and the Gates brand name.", "review_title": "Four Stars", "language": "en", "product_category": "automotive"}
{"review_id": "en_0830645", "product_id": "product_en_0619980", "reviewer_id": "reviewer_en_0356524", "stars": "4", "review_body": "Nice product very soft, great quality!", "review_title": "Four Stars", "language": "en", "product_category": "home"}
{"review_id": "en_0704104", "product_id": "product_en_0155898", "reviewer_id": "reviewer_en_0603634", "stars": "4", "review_body": "Very comfortable, would recommend", "review_title": "Four Stars", "language": "en", "product_category": "automotive"}
{"review_id": "en_0942611", "product_id": "product_en_0499009", "reviewer_id": "reviewer_en_0046601", "stars": "4", "review_body": "It’s pretty low tech but does what you want it to do.", "review_title": "Works well for the money.", "language": "en", "product_category": "pc"}
{"review_id": "en_0191575", "product_id": "product_en_0493394", "reviewer_id": "reviewer_en_0737695", "stars": "4", "review_body": "Great clean looking product. Wish it had a place for loose papers but still very well thought out item for the money", "review_title": "1/3rd the price of anything you’ll find at big box stores with better quality", "language": "en", "product_category": "office_product"}
{"review_id": "en_0549040", "product_id": "product_en_0107048", "reviewer_id": "reviewer_en_0417856", "stars": "4", "review_body": "Fun pack of stickers that I used as treats during science day presentations. They're not super sticky but they work fine on paper. They even included Pluto in the mix which the kids thought was amazing.", "review_title": "Fun pack of stickers that I used as treats during ...", "language": "en", "product_category": "drugstore"}
{"review_id": "en_0948516", "product_id": "product_en_0296281", "reviewer_id": "reviewer_en_0678000", "stars": "4", "review_body": "It was just a teensy bit small, the fabric is thin but makes it very soft. I love it! I've had a difficult time finding team bandanas, and the price was great! I will update after some wear and tear....", "review_title": "soft and cute", "language": "en", "product_category": "sports"}
{"review_id": "en_0362299", "product_id": "product_en_0687894", "reviewer_id": "reviewer_en_0319070", "stars": "4", "review_body": "A little on the expensive side, but it does help with puppy pimples. Our bulldog gets zits sometimes from eating yogurt and this helps make them go away quick. Would recommend.", "review_title": "Great for puppy pimples.", "language": "en", "product_category": "pet_products"}
{"review_id": "en_0065619", "product_id": "product_en_0046267", "reviewer_id": "reviewer_en_0457722", "stars": "4", "review_body": "it’s i little bit big, but really cute and comfortable. i’ve gotten so many compliments wearing this shirt", "review_title": "but really cute and comfortable. i’ve gotten so many compliments wearing this shirt", "language": "en", "product_category": "apparel"}
{"review_id": "en_0809857", "product_id": "product_en_0287613", "reviewer_id": "reviewer_en_0898202", "stars": "4", "review_body": "The small 60X and 90X lenses are too small to be of any use, but the large 30X lens and LED work perfect for what I use it for (Examining watches at flea markets before I buy). There is no On/Off switch for the LED as it turns on as soon as you open it, but if you push it back in a tiny amount, it will shut off. For less than $10, it really is a good deal.", "review_title": "The 60X and 90X are pretty useless, but the 30X is perfect.", "language": "en", "product_category": "home"}
{"review_id": "en_0022944", "product_id": "product_en_0562305", "reviewer_id": "reviewer_en_0704882", "stars": "4", "review_body": "Good keyboard for the money. Been using for the past month, no issues.", "review_title": "Four Stars", "language": "en", "product_category": "pc"}
{"review_id": "en_0700764", "product_id": "product_en_0598414", "reviewer_id": "reviewer_en_0931400", "stars": "4", "review_body": "We only use the clock for time, not as an alarm. The letters are large and easy to read from across the room. However, even the dim setting is pretty bright. I would prefer something even dimmer to minimize the amount of light in the bedroom. The power cable has uses a USB connection but does not include a USB power adapter in the box.", "review_title": "Does the job", "language": "en", "product_category": "home"}
{"review_id": "en_0597506", "product_id": "product_en_0731383", "reviewer_id": "reviewer_en_0990828", "stars": "4", "review_body": "The kids will have a good laugh when they go through this book. It's full of hundreds of funny yet simple to understand jokes that are bound to keep them entertained for hours on end. I chose this rating because I thought this book was sooper funny. I didn't dislike this joke book at all I loved all of the clean jokes for kids. It was really inspiring. I honestly would recemend this book to anyone who likes jokes, because after reading this book you will love jokes and be inspired to right jokes like I was.", "review_title": "Plenty of Jokes to Keep The Kiddies Entertained.", "language": "en", "product_category": "digital_ebook_purchase"}
{"review_id": "en_0862464", "product_id": "product_en_0577603", "reviewer_id": "reviewer_en_0566218", "stars": "4", "review_body": "The screen protector was not glass like it said it was didn't last but two months", "review_title": "Four Stars", "language": "en", "product_category": "wireless"}
{"review_id": "en_0404041", "product_id": "product_en_0285562", "reviewer_id": "reviewer_en_0801535", "stars": "4", "review_body": "I purchased this exhaust to replace an old Broan that sounded like an airplane. While this unit is not completely silent, it Is a very low sounding extractor. Verify your measurements before you purchase. My electrician had to work pretty hard to install this unit. Overall, I am very pleased.", "review_title": "Huge improvement", "language": "en", "product_category": "home_improvement"}
{"review_id": "en_0648192", "product_id": "product_en_0121059", "reviewer_id": "reviewer_en_0891249", "stars": "4", "review_body": "Product was as described. You can buy direct from Mfg. in bulk for a discount Taste is pretty good. I add it to low carb home made shakes. Mixes well A tad expensive, but you use very little per day. Comes with 1/2 tsp measure cup", "review_title": "Mixes well, high quality product.", "language": "en", "product_category": "drugstore"}
{"review_id": "en_0828307", "product_id": "product_en_0401694", "reviewer_id": "reviewer_en_0201969", "stars": "4", "review_body": "Great OEM battery. Performs just like original.", "review_title": "Good battery", "language": "en", "product_category": "wireless"}
{"review_id": "en_0394851", "product_id": "product_en_0513124", "reviewer_id": "reviewer_en_0324464", "stars": "4", "review_body": "It's been a while since I have been in love with a book and this is right up there as a great read", "review_title": "It's been a while since I have been in love with a book and this is right up there ...", "language": "en", "product_category": "digital_ebook_purchase"}
{"review_id": "en_0952411", "product_id": "product_en_0104256", "reviewer_id": "reviewer_en_0858167", "stars": "4", "review_body": "It came as it was described.", "review_title": "easy to clean", "language": "en", "product_category": "furniture"}
{"review_id": "en_0541208", "product_id": "product_en_0429512", "reviewer_id": "reviewer_en_0459683", "stars": "4", "review_body": "Although it was a little difficult to install on my 3D printer, it probably wouldn't be for many. My Maker Select V2 was never designed for it and I had to rewire the machine to allow it to work. That isn't of any fault to the BLTouch. It's worked flawlessly.", "review_title": "Works very well.", "language": "en", "product_category": "camera"}
{"review_id": "en_0708831", "product_id": "product_en_0437241", "reviewer_id": "reviewer_en_0736003", "stars": "4", "review_body": "For the price serviceable", "review_title": "Ok", "language": "en", "product_category": "toy"}
{"review_id": "en_0308338", "product_id": "product_en_0375981", "reviewer_id": "reviewer_en_0848701", "stars": "4", "review_body": "Beautiful!! I really enjoy this product. I wish the top screwed on to be secure but other than that nice product.", "review_title": "Nice", "language": "en", "product_category": "drugstore"}
{"review_id": "en_0808614", "product_id": "product_en_0482371", "reviewer_id": "reviewer_en_0851734", "stars": "4", "review_body": "I work in a fiberglass factory on the furnace level. Wet this down to help cool me off. It works. I wear a hat over it and I dont have any issues so far. This is my first week with it. Only reason I havent put 5 stars is because Its so new.", "review_title": "It works.", "language": "en", "product_category": "sports"}
{"review_id": "en_0517682", "product_id": "product_en_0521896", "reviewer_id": "reviewer_en_0305126", "stars": "4", "review_body": "Had problem at first installing it. Called manufacture and got the help I needed.", "review_title": "my new hitch", "language": "en", "product_category": "automotive"}
{"review_id": "en_0158404", "product_id": "product_en_0705454", "reviewer_id": "reviewer_en_0016070", "stars": "4", "review_body": "Just received this bag yesterday. It is very cute and looks like it will hold up. There are several pockets inside and outside of the bag which is nice. The beige top of the bag arrived with several black spots on it. Some wiped clean and I’m hoping the others will come off with some soap. Looks like it may have happened during packaging. It’s a bummer that it came dirty but the outer material is easy to wipe down! It is a good size, will hold a lot without being cumbersome!", "review_title": "Cute bag!", "language": "en", "product_category": "baby_product"}
{"review_id": "en_0150840", "product_id": "product_en_0934480", "reviewer_id": "reviewer_en_0413648", "stars": "4", "review_body": "Bought for a gift ! Hoping my daughter in law likes. The earrings look nice!", "review_title": "The earrings look nice!", "language": "en", "product_category": "jewelry"}
{"review_id": "en_0242287", "product_id": "product_en_0194640", "reviewer_id": "reviewer_en_0870085", "stars": "4", "review_body": "Very happy with this.", "review_title": "Happy", "language": "en", "product_category": "automotive"}
{"review_id": "en_0576669", "product_id": "product_en_0232438", "reviewer_id": "reviewer_en_0364674", "stars": "4", "review_body": "It's what I ordered but some got broken in transit and I think a little more packaging cushion would have been ideal.", "review_title": "It's what I ordered but some got broken in transit ...", "language": "en", "product_category": "grocery"}
{"review_id": "en_0033298", "product_id": "product_en_0480776", "reviewer_id": "reviewer_en_0985413", "stars": "4", "review_body": "Loose but feels great still! Material kind of think but again still feels nice. Love the length!!", "review_title": "LOVE IT!", "language": "en", "product_category": "apparel"}
{"review_id": "en_0639020", "product_id": "product_en_0082983", "reviewer_id": "reviewer_en_0446420", "stars": "4", "review_body": "It was a very pretty gift to give, and allot more sturdy then I believed, my mom loved it. I did expect it to be a bit bigger, the betty boop in the middle is small and easily over looked", "review_title": "Cute small gift", "language": "en", "product_category": "home"}
{"review_id": "en_0757028", "product_id": "product_en_0302792", "reviewer_id": "reviewer_en_0008427", "stars": "4", "review_body": "This book was very interesting. I knew i had to read it when it said mind reader- i`m a sucker for them!", "review_title": "Fun story!", "language": "en", "product_category": "digital_ebook_purchase"}
{"review_id": "en_0363541", "product_id": "product_en_0560572", "reviewer_id": "reviewer_en_0727280", "stars": "4", "review_body": "A perfect find Beautiful perfect great, Awesome cord!!! These cords are great.", "review_title": "The material used in these are so much better than Apple", "language": "en", "product_category": "wireless"}
{"review_id": "en_0357966", "product_id": "product_en_0864758", "reviewer_id": "reviewer_en_0776628", "stars": "4", "review_body": "The glass carafe is perfect. The handle has a beautiful shape but is a bit hard for my older hand to grasp. The lid is a bit small and has this strange filter suspended near the spout, not sure what it is supposed to do. The kettle wouldn't shut off after the water boils. Was it defective? No just had to get out my college science hat and remember that at our 5,000 foot elevation water boils at 2 degrees less per 1,000 feet of elevation. So when the water boils it is only 202 not 212 degrees f as at sea level, not high enough to trigger the shut off switch. An option would be to set it at 195 degree \"keep warm\" if you need an automatic shut off. That is fairly close to 202 degrees. We have used the kettle at least 2 times daily for 3 months. It is so much better than the old metal kettle on the stove. I doubt you are going to find anything much better or as practical.", "review_title": "In search of the perfect kettle.", "language": "en", "product_category": "kitchen"}
{"review_id": "en_0338121", "product_id": "product_en_0289118", "reviewer_id": "reviewer_en_0197840", "stars": "4", "review_body": "This dress is beautiful, well made and of great quality materials. The matching bloomers, however are much too small to fit over a diaper.", "review_title": "beautiful, well made and of great quality", "language": "en", "product_category": "apparel"}
{"review_id": "en_0008482", "product_id": "product_en_0579005", "reviewer_id": "reviewer_en_0115030", "stars": "4", "review_body": "a little pricey for the quality feel.", "review_title": "Four Stars", "language": "en", "product_category": "home_improvement"}
{"review_id": "en_0647672", "product_id": "product_en_0930533", "reviewer_id": "reviewer_en_0940924", "stars": "4", "review_body": "I bought this espresso set for my boss as a gift. It came in very nice and sturdy package. I was afraid that it will arrive broken from my last experience ordered glass item but didn’t have any problems at all. Great size. Not too small and it has very unique shape. The only reason I am giving 4 stars is vecause the leaf plate is a bit too smooth.", "review_title": "It came in very nice and sturdy package", "language": "en", "product_category": "home"}
{"review_id": "en_0334613", "product_id": "product_en_0067763", "reviewer_id": "reviewer_en_0709320", "stars": "4", "review_body": "look for battery compartment on the side. Tried it of one car - showed excessive water in brake fluid. going to test it on a new can of fluid just to be sure.", "review_title": "accuracy of meter", "language": "en", "product_category": "automotive"}
{"review_id": "en_0203779", "product_id": "product_en_0274513", "reviewer_id": "reviewer_en_0565401", "stars": "4", "review_body": "I love that the lights are bright, flash and change colors. They demand attention. I hope people see me and avoid hitting me rather than wonder \"what is that?\" and run me over to get a closer look. So, I wrapped them around the pole. It looks awesome. But the next day, the clear, squishy plastic came off in places. Don't try this at home. Even if I did no harm, it doesn't look good. I bought two, one had a rip in the plastic. The replacement will go on the other pole without getting bent, twisted,rolled or mutilated.", "review_title": "pros and cons", "language": "en", "product_category": "home_improvement"}
{"review_id": "en_0931786", "product_id": "product_en_0558423", "reviewer_id": "reviewer_en_0589957", "stars": "4", "review_body": "It works well. Comes with everything to get started except for remote control batteries.", "review_title": "A decent box for the price.", "language": "en", "product_category": "other"}
{"review_id": "en_0981678", "product_id": "product_en_0063931", "reviewer_id": "reviewer_en_0131374", "stars": "4", "review_body": "It's great to have a brush that also blow dries my hair! It was a little confusing what the 3 settings actually do. Thankfully, the seller sent an email to explain: LOW--Cool Heat & High Air Speed MIDDLE--Warm Temp & Low Air Speed HIGH--Hot Temp & High Air Speed **Please note that the sign of settings indicates the heat and temperature, not the air speed. In other word, there are 3 level of heat and 2 blower speed. It is different from other hair dryer and it is easy for you to have a confused idea that settings are broke. If you encounter this confusion, please be eased. This helped to clear up the confusion. Good product!", "review_title": "Confusing settings but good drying brush", "language": "en", "product_category": "kitchen"}
{"review_id": "en_0016262", "product_id": "product_en_0752816", "reviewer_id": "reviewer_en_0685031", "stars": "4", "review_body": "Beautiful; however, much smaller in size than a regular greeting card. The size of card is reason for not rating as a *****Star.", "review_title": "Set of 3 Thank You Greeting Cards - 3D Popup...", "language": "en", "product_category": "drugstore"}
{"review_id": "en_0818895", "product_id": "product_en_0525138", "reviewer_id": "reviewer_en_0870312", "stars": "4", "review_body": "An all time family favorite! Customizing the cards used in each game keeps it interesting, especially when I let the kids decide", "review_title": "Great game", "language": "en", "product_category": "toy"}
{"review_id": "en_0610506", "product_id": "product_en_0100194", "reviewer_id": "reviewer_en_0320524", "stars": "4", "review_body": "Like that they feel cool when on. Wanted them for sun protection while golfing.", "review_title": "They seem to,work.", "language": "en", "product_category": "sports"}
{"review_id": "en_0934643", "product_id": "product_en_0227777", "reviewer_id": "reviewer_en_0047589", "stars": "4", "review_body": "Good book that takes you back to original movie. Would recommend to any age group. Easy read also. Many memories of what one learned when saw the movie.", "review_title": "Good read", "language": "en", "product_category": "digital_ebook_purchase"}
{"review_id": "en_0938655", "product_id": "product_en_0198593", "reviewer_id": "reviewer_en_0231870", "stars": "4", "review_body": "Smells good but fades fast", "review_title": "Four Stars", "language": "en", "product_category": "drugstore"}
{"review_id": "en_0766450", "product_id": "product_en_0162179", "reviewer_id": "reviewer_en_0944854", "stars": "4", "review_body": "Looks cute! I think it will be popular with my granddaughter?! (Christmas stocking gift)", "review_title": "Fast delivery!", "language": "en", "product_category": "apparel"}
{"review_id": "en_0718302", "product_id": "product_en_0040582", "reviewer_id": "reviewer_en_0643962", "stars": "4", "review_body": "I have a 90 yr old friend who is having serious dry mouth issues. She was using Biotene spray but it didn't last long enough for her problem and she had a hard time talking due to dry mouth. I sent her these and she loved them so much that she shared with her neighbor at the assisted living facility. He loved them so much he said he'd buy the next box and share with her. I'm grateful!", "review_title": "Much better pricing than biotene, but the flavor is just ok. Works very well, per elderly friend.", "language": "en", "product_category": "beauty"}
{"review_id": "en_0038510", "product_id": "product_en_0777271", "reviewer_id": "reviewer_en_0178821", "stars": "4", "review_body": "This is an extremely cute and comfy dress. Definitely would be a great go to dress. I am returning it though because it is a little too long on me and kind of makes me a look a little frumpy. I noticed on most people it appears to hit just below the knee but it goes about mid calf for me. I am 5’3", "review_title": "Great dress, a little long though", "language": "en", "product_category": "apparel"}
{"review_id": "en_0480211", "product_id": "product_en_0665770", "reviewer_id": "reviewer_en_0622903", "stars": "4", "review_body": "Installed the first of four of them I ordered and I learned not to tighten down collar too tight or the \"loose\" collar above it is difficult to align for the camera. Other than that, pretty easy to install.", "review_title": "Great product.....", "language": "en", "product_category": "electronics"}
{"review_id": "en_0176094", "product_id": "product_en_0641516", "reviewer_id": "reviewer_en_0276481", "stars": "4", "review_body": "I bought the clear. They aren't flimsy and they do what they are supposed to do.", "review_title": "Just what you'd expect.", "language": "en", "product_category": "office_product"}
{"review_id": "en_0059526", "product_id": "product_en_0190915", "reviewer_id": "reviewer_en_0212169", "stars": "4", "review_body": "Very cute workout tanks. The material seems good. They are much smaller than expected. I wear a medium and they fit like a small. Order a size up if you don’t want it tight and form fitting.", "review_title": "Cute but run small", "language": "en", "product_category": "apparel"}
{"review_id": "en_0369807", "product_id": "product_en_0464275", "reviewer_id": "reviewer_en_0644441", "stars": "4", "review_body": "good pruduct , fast service", "review_title": "fast delivery", "language": "en", "product_category": "other"}
{"review_id": "en_0470275", "product_id": "product_en_0271812", "reviewer_id": "reviewer_en_0435821", "stars": "4", "review_body": "Bought 4 sacks, 3 different brands. This is a great sack. The reason this one is cheaper than the others is because it doesn’t have a removable cover. The outer cover is the only cover (other brands have stuffing in a sack, with a zipper so you can add more stuffing) and that sack goes inside the shell. It is made with two zippers. Zipper inside a zipper. Shell feels a little thicker than the other brands, but not as soft. Same amount of stuffing included. Outer shell might be the only real difference.", "review_title": "No washable outer shell might be the main difference", "language": "en", "product_category": "furniture"}
{"review_id": "en_0022820", "product_id": "product_en_0349102", "reviewer_id": "reviewer_en_0229987", "stars": "4", "review_body": "Did the job, cable is very small gauge", "review_title": "Small gauge", "language": "en", "product_category": "other"}
{"review_id": "en_0601818", "product_id": "product_en_0513775", "reviewer_id": "reviewer_en_0310112", "stars": "4", "review_body": "Does not fit as flattering as I thought it would but its and okay product", "review_title": "Okay", "language": "en", "product_category": "apparel"}
{"review_id": "en_0940597", "product_id": "product_en_0751205", "reviewer_id": "reviewer_en_0950937", "stars": "4", "review_body": "My only complaint is that the handle is hollow and digs into your hand. Wear gloves. I use it to store 100 ft of 12/3 cord which fits comfortably (it won't hold anything longer at this gauge) Would definitely recommend.", "review_title": "Nicely Made, Sturdy, Compact", "language": "en", "product_category": "home_improvement"}
{"review_id": "en_0235402", "product_id": "product_en_0704762", "reviewer_id": "reviewer_en_0259639", "stars": "4", "review_body": "Pretty good product for the price. My only complaint is the lashes don’t seem to have a curve to them which made application extremely difficult. Does the job for a good price. Note: it does not come with lash glue", "review_title": "Pretty good product for the price", "language": "en", "product_category": "wireless"}
{"review_id": "en_0520510", "product_id": "product_en_0958350", "reviewer_id": "reviewer_en_0062628", "stars": "4", "review_body": "Wig is super soft and very pretty. Only issue is that it’s a bit small, other than that it looks and feels great.", "review_title": "A bit on the small side", "language": "en", "product_category": "beauty"}
{"review_id": "en_0649390", "product_id": "product_en_0347421", "reviewer_id": "reviewer_en_0594411", "stars": "4", "review_body": "Great shoes for doing chores at the barn BUT they could be a little wider. I do find they hurt my baby toes but I have plenty of room in the length. I bought the next bigger size hoping they wouldn't hurt my feet.", "review_title": "Good", "language": "en", "product_category": "lawn_and_garden"}
{"review_id": "en_0031663", "product_id": "product_en_0446795", "reviewer_id": "reviewer_en_0878452", "stars": "4", "review_body": "Mount works great. Only down fall is that the TV is tight to the wall, if plugs/inputs are on the backside of TV, you will need to add spacer to the mount to push it away from the wall.", "review_title": "Easy installation", "language": "en", "product_category": "electronics"}
{"review_id": "en_0077763", "product_id": "product_en_0615127", "reviewer_id": "reviewer_en_0501721", "stars": "4", "review_body": "I loved this series of books (Ancient Origins) and just read the series a second time. The author is unique and I like that. I do hope there is another book in this series.", "review_title": "Unique", "language": "en", "product_category": "digital_ebook_purchase"}
{"review_id": "en_0259195", "product_id": "product_en_0364906", "reviewer_id": "reviewer_en_0014869", "stars": "4", "review_body": "I have heard of these ultrasonic pest control gadgets but have never used them before. I was tired of using chemicals to get rid of my bug and rodent problem. I have a cabin in the woods and we will get mice from time to time. I have now had this installed now for several weeks and no sign of anything. Usually when we go away for a few day and find some dropping when we return. Nothing yet so far. I am hopeful. There is no sound or odor. If the critters stay gone I'll change my review to a 5 star.", "review_title": "Finally no chemicals", "language": "en", "product_category": "lawn_and_garden"}
{"review_id": "en_0605964", "product_id": "product_en_0802496", "reviewer_id": "reviewer_en_0325403", "stars": "4", "review_body": "Very nice, well made.", "review_title": "Four Stars", "language": "en", "product_category": "apparel"}
{"review_id": "en_0080994", "product_id": "product_en_0646050", "reviewer_id": "reviewer_en_0012478", "stars": "4", "review_body": "Arrived on time and well packaged. Have not tried all the scents, but the ones I have smell nice.", "review_title": "Good quality.", "language": "en", "product_category": "beauty"}
{"review_id": "en_0370303", "product_id": "product_en_0811299", "reviewer_id": "reviewer_en_0590411", "stars": "4", "review_body": "The only reason this doesn’t get 5 stars is because it globs up in water making a thick paste. Otherwise AWESOME buy for the price. Works great in coffee and shakes but globs up and sticks to the bottom in a pitcher of water.", "review_title": "Good price, decent product!", "language": "en", "product_category": "drugstore"}
{"review_id": "en_0222380", "product_id": "product_en_0769339", "reviewer_id": "reviewer_en_0228364", "stars": "4", "review_body": "This was more than a story about cricket - this was a story of a young, strong muslim women trying to pursue her dream to play a sport in India. Her struggles to overcome her culture and traditions were inspiring and eye opening. The cinematography was gorgeous - I loved the feeling of being in India. The music was spot on and the over all story/message was enlightening. I hope everyone can see this film. Well done!", "review_title": "Absolutely Beautiful!", "language": "en", "product_category": "digital_video_download"}
{"review_id": "en_0331200", "product_id": "product_en_0963018", "reviewer_id": "reviewer_en_0911702", "stars": "4", "review_body": "The shoes are decent quality (especially considering the price.) I ordered the tan color and it is true to the photos. I wear a size 8 and while I do sometimes have to size up when I'm wearing boots (to accommodate thick socks) I dont usually with flats. With this pair my toes fit snugly into the front of the shoe and the width of the shoe is a bit tighter than I usually like, but not too uncomfortable. I am hoping that as I break them in that issue will be solved. If not, if i were to buy another pair, I would consider going up a half size.", "review_title": "Comfortable, but slightly narrow", "language": "en", "product_category": "other"}
{"review_id": "en_0204466", "product_id": "product_en_0169142", "reviewer_id": "reviewer_en_0177368", "stars": "4", "review_body": "This os a great cover if u have the pokeball plus and want to keep it clean and scratch free. The only down side seems that the charging stand that i got will not charge with the case on. Seems to also make the ball a little bit bigger too. Wish the clear one was available. Overall seems like a great product.", "review_title": "Great cover.", "language": "en", "product_category": "electronics"}
{"review_id": "en_0533853", "product_id": "product_en_0687462", "reviewer_id": "reviewer_en_0950753", "stars": "4", "review_body": "The foam does not feel like memory foam. It actually feels kinda hard and rough, but it's comfortable enough. I suppose the toughness of the foam gives me some confidence that it will last me for awhile and won't break down or become flat. It feels better to use the cushion, than without it or with a regular seat/pillow cushion. Upon arrival, it had a strong rubbery smell that also stinks anything that it touches, but the smell seems to goes away over time and becomes less noticeable. I think the cost should be cheaper for the quality. Overall, I like the cushion and it's been helpful for my piles when I need to sit for long periods.", "review_title": "Decent donut cushion for hemorrhoids", "language": "en", "product_category": "drugstore"}
{"review_id": "en_0549827", "product_id": "product_en_0531204", "reviewer_id": "reviewer_en_0781578", "stars": "4", "review_body": "Provides great ideas and practical methods without hundreds of hours of practice. I found the book quite useful.", "review_title": "Practical and useful", "language": "en", "product_category": "digital_ebook_purchase"}
{"review_id": "en_0518017", "product_id": "product_en_0062530", "reviewer_id": "reviewer_en_0451570", "stars": "4", "review_body": "Wow! Pats life story is amazing. Enjoyed this book and think it would make a great movie. Rabbit doesn't hold back and it shows her life story was one that had to be told.", "review_title": "Rabbit you amaze!", "language": "en", "product_category": "digital_ebook_purchase"}
{"review_id": "en_0190868", "product_id": "product_en_0219130", "reviewer_id": "reviewer_en_0890614", "stars": "4", "review_body": "The reason why I gave it a 4 star instead of 5 is the color. The color says bronze but in actually it is almost black. I wanted a dark brown color.....", "review_title": "Solid and good looking hideaway", "language": "en", "product_category": "lawn_and_garden"}
{"review_id": "en_0230252", "product_id": "product_en_0063376", "reviewer_id": "reviewer_en_0043874", "stars": "4", "review_body": "It does moisturize. Its light enough and didn't lead to breakouts for me .", "review_title": "Good", "language": "en", "product_category": "beauty"}
{"review_id": "en_0211505", "product_id": "product_en_0905683", "reviewer_id": "reviewer_en_0849416", "stars": "4", "review_body": "THIS IS A TRUSTWORTHY COMPANY THAT STANDS BEHIND ITS PRODUCT. BUT IT'S TOO EARLY TO TELL HOW IT WORKS WITH THIS NEW HP 'STUDENT PRINTER' THAT STILL HAS ITS ORIGINAL INK CARTRIDGES.", "review_title": "TOO EARLY TO REPORT", "language": "en", "product_category": "office_product"}
{"review_id": "en_0267625", "product_id": "product_en_0273133", "reviewer_id": "reviewer_en_0115517", "stars": "4", "review_body": "Just put it together", "review_title": "fast shipping", "language": "en", "product_category": "toy"}
{"review_id": "en_0300115", "product_id": "product_en_0985061", "reviewer_id": "reviewer_en_0794035", "stars": "4", "review_body": "Best flashlight I've ever owned. Love the magnetic base and its extremely bright. It's not 2000 lumen. Friend at work had 1500 lumen light that was a bit brighter. A little bulky to fit in your pocket though. But you get 2 of them so I'm not complaining!", "review_title": "Great Flashlight", "language": "en", "product_category": "other"}
{"review_id": "en_0514787", "product_id": "product_en_0997558", "reviewer_id": "reviewer_en_0360259", "stars": "4", "review_body": "Being from Louisiana myself and having married into a Cajun family I really enjoy these stories. This particular one had laughs in the right places, but the development of Miss Prim and Proper was too simple. A writer herself Miss Prim and Proper should have had more interest in just what the ladies past experiences had been. All in all a good read before sleeping.", "review_title": "Another funny Louisiana story", "language": "en", "product_category": "digital_ebook_purchase"}
{"review_id": "en_0271858", "product_id": "product_en_0599071", "reviewer_id": "reviewer_en_0034287", "stars": "4", "review_body": "We used these for the first time this past week, as hoped they were much better than a traditional snorkel set. We we were able to breath normally, see clearly and no water got into the mask. We did have an issue getting the mask snug at first (and the enclosed directions were not very helpful) but we were able to figure it out .", "review_title": "It works as described", "language": "en", "product_category": "other"}
{"review_id": "en_0352916", "product_id": "product_en_0295218", "reviewer_id": "reviewer_en_0131533", "stars": "4", "review_body": "This story was told in a wonderful way. I like how you got to know the whole family and all the background. I would recommend this book! Really enjoyed it.", "review_title": "Good story", "language": "en", "product_category": "digital_ebook_purchase"}
{"review_id": "en_0476002", "product_id": "product_en_0553420", "reviewer_id": "reviewer_en_0226111", "stars": "4", "review_body": "My dog finds this pretty edible - we used the tablets for some time, but eventually he started leaving them or turning up his nose. Since this gets mixed into his food, he does well with it. Packaging is good - although I'm not fond of this type of security seal. Shipping is on time as well.", "review_title": "My dog likes it", "language": "en", "product_category": "pet_products"}
{"review_id": "en_0056700", "product_id": "product_en_0527061", "reviewer_id": "reviewer_en_0742459", "stars": "4", "review_body": "Too many dark things around what could have been a beautiful wedding. Dogs played a very small role. Others in the series have been better.", "review_title": "This one is darker than normal.", "language": "en", "product_category": "digital_ebook_purchase"}
{"review_id": "en_0133537", "product_id": "product_en_0833729", "reviewer_id": "reviewer_en_0271489", "stars": "4", "review_body": "This one works great on my LG phone. It's small size and very portable. I like the white color. Nothing to complain.", "review_title": "Works great.", "language": "en", "product_category": "pc"}
{"review_id": "en_0187881", "product_id": "product_en_0750079", "reviewer_id": "reviewer_en_0774837", "stars": "4", "review_body": "Loved it!! BUT... Arrived with a broken tail, with that said to avoid the hassles of returning it we improvised and hide his tail in the gravel. Makes a wonderful addition to our tank and my son LOVES it!!!", "review_title": "Loved it!", "language": "en", "product_category": "pet_products"}
{"review_id": "en_0143695", "product_id": "product_en_0457338", "reviewer_id": "reviewer_en_0796429", "stars": "4", "review_body": "The fit is a bit snug on medium sized hands. I like these a lot, but I feel like the thickness of the pad is a bit much. Does a good job of protecting your hands but the tradeoff is that you lose bar feel.", "review_title": "Good gloves, slightly thicker than you'd want if you like \"bar feel\".", "language": "en", "product_category": "sports"}
{"review_id": "en_0049368", "product_id": "product_en_0152166", "reviewer_id": "reviewer_en_0072383", "stars": "4", "review_body": "Love everything about this bag, but I do wish there were pockets to put other things like snacks, treats, a leash, etc. Otherwise my puppy and I love it. Have already tested it on bike rides and it really helps us bond.", "review_title": "Great Dog Backpack, but needs 1-2 more pockets!", "language": "en", "product_category": "pet_products"}
{"review_id": "en_0282282", "product_id": "product_en_0732318", "reviewer_id": "reviewer_en_0625756", "stars": "4", "review_body": "I like these. Great for starter throwing knifes. Strong tips hold up well after multiple throws.", "review_title": "Great starter set.", "language": "en", "product_category": "sports"}
{"review_id": "en_0700303", "product_id": "product_en_0739725", "reviewer_id": "reviewer_en_0031012", "stars": "4", "review_body": "These are great, they taste like normal, wheat pasta. A great alternative for low carb diets", "review_title": "Great taste, low carbs", "language": "en", "product_category": "grocery"}
{"review_id": "en_0705537", "product_id": "product_en_0210507", "reviewer_id": "reviewer_en_0067356", "stars": "4", "review_body": "I just finished this book today. I have to admit, the further I got into this book, the more it kept me engaged. I am not sure who the target reader is for this book, as there are many who could find something worthwhile in it, but it makes sense that it is in the Contemporary fiction genre. It is true to life and very realistic. The character of Swain becomes more likable as the story moves on. With each chapter, the drama of Swain's recent life, the divorce, and the loss of his daughter all unfold. I felt for him in his losses and in his joys that he feared to embrace for so long. The Jones character seems to simply exist as a foil to Swain's character; he is the jerk of a friend that one just can't let go of. The details of living in Hong Kong and the ups and downs of living on a boat were pretty interesting. I saw some areas that could use another edit, but other than that the writing was well-done, the vocabulary was vivid, and the story was engaging.", "review_title": "An Engaging Read about a Different Way of Life", "language": "en", "product_category": "digital_ebook_purchase"}
{"review_id": "en_0246805", "product_id": "product_en_0288154", "reviewer_id": "reviewer_en_0838944", "stars": "4", "review_body": "Fantastic product to use for sunburn. Delivery was prompt too.", "review_title": "Soothes sunburn quickly.", "language": "en", "product_category": "drugstore"}
{"review_id": "en_0864895", "product_id": "product_en_0543531", "reviewer_id": "reviewer_en_0666453", "stars": "4", "review_body": "I bought this to wear with leggings while pregnant, and it does the job. I don't love the pattern; it seems more like a poorly tie dyed shirt in person, but for my purposes, it's okay. It seems a little more \"middle aged woman\" than trendy young mom, so I don't anticipate wearing it much once I'm not carrying a human inside me.", "review_title": "Not bad, but wouldn't be flattering for someone with a great figure.", "language": "en", "product_category": "apparel"}
{"review_id": "en_0042684", "product_id": "product_en_0947733", "reviewer_id": "reviewer_en_0404131", "stars": "4", "review_body": "Disclosure: I was sent this product in exchange for an honest review. Overall, I really like this case/sleeve. I do not have a Macbook so I tried it with two different sized computers and they both fit so there is plenty of room. The zipper opens on three sides which allows the case to open completely and lay flat on the table. The inside is cushioned and provides protection for the device. I do love the color though it looks closer to royal than navy blue. One downside for me is that there is no handle or strap with which to carry the case. The case would easily fit inside a backpack or briefcase but would be a bit more cumbersome to carry alone. In addition, the case is a fairly slick material so it can slip out of your hand while carrying. It is waterproof (I tested it by putting a sheet of paper inside and holding it out in the rain; the paper remained dry) and has a roomy zippered pocket on the outside for carrying a mouse or ear buds or other items. Overall, I like this product. I won't get a chance to use it, however, as my son immediately took it for his school computer- a perfect fit.", "review_title": "Perfect Fit", "language": "en", "product_category": "office_product"}
{"review_id": "en_0766899", "product_id": "product_en_0430736", "reviewer_id": "reviewer_en_0696658", "stars": "4", "review_body": "These are very tiny. That's the only reason I give 4 stars. They are very strong. Good magnets", "review_title": "Good", "language": "en", "product_category": "kitchen"}
{"review_id": "en_0930967", "product_id": "product_en_0973027", "reviewer_id": "reviewer_en_0910525", "stars": "4", "review_body": "This works very well. Love that the cord is chew resistant and that you can set the temperature. I use this under our Golden Retriever's bed. She just had a litter of 8 puppies and this pad allows her to leave them without us worrying about them getting cold. 4 stars because I thought it would be bigger. Please note it isn't the size for a Golden Retriever.", "review_title": "Works very well", "language": "en", "product_category": "pet_products"}
{"review_id": "en_0465157", "product_id": "product_en_0885016", "reviewer_id": "reviewer_en_0182553", "stars": "4", "review_body": "These are great and I absolutely love the look, but with any yarn product it will start to fray. I believe mine started within two weeks but I would buy again.", "review_title": "These are great and I absolutely love the look", "language": "en", "product_category": "apparel"}
{"review_id": "en_0316145", "product_id": "product_en_0589778", "reviewer_id": "reviewer_en_0116157", "stars": "4", "review_body": "Product as described.", "review_title": "Four Stars", "language": "en", "product_category": "apparel"}
{"review_id": "en_0270630", "product_id": "product_en_0499313", "reviewer_id": "reviewer_en_0653336", "stars": "4", "review_body": "This was a nice, light read. The characters are believable and enjoyable. I will read more books in this series.", "review_title": "Nice cozy", "language": "en", "product_category": "digital_ebook_purchase"}
{"review_id": "en_0744789", "product_id": "product_en_0022278", "reviewer_id": "reviewer_en_0855837", "stars": "4", "review_body": "This are lovely, but ok only giving it four starts becouse I thought they were going to be a little bigger.", "review_title": "Perfect wedding gift!", "language": "en", "product_category": "kitchen"}
{"review_id": "en_0626402", "product_id": "product_en_0610164", "reviewer_id": "reviewer_en_0067396", "stars": "4", "review_body": "I am disappointed in the quality of this wallet. When you first look at it new it looks great but when it is used for a month it looks like it is years old. It does not have any torn places yet and no worn places but a little disappointed in the looks.", "review_title": "Nice wallet", "language": "en", "product_category": "apparel"}
{"review_id": "en_0361613", "product_id": "product_en_0945551", "reviewer_id": "reviewer_en_0055250", "stars": "4", "review_body": "Seems to fit more comfortably on my right foot than my left, but I like them a lot.", "review_title": "Four Stars", "language": "en", "product_category": "shoes"}
{"review_id": "en_0296503", "product_id": "product_en_0728440", "reviewer_id": "reviewer_en_0910031", "stars": "4", "review_body": "Chris Pratt stole this show and I thought I was going to hate it. It’s pretty good. Check it out.", "review_title": "Love Me Some Chris Pratt", "language": "en", "product_category": "digital_video_download"}
{"review_id": "en_0954019", "product_id": "product_en_0887903", "reviewer_id": "reviewer_en_0216298", "stars": "4", "review_body": "These are great if you have a small waist, narrow hips. They last much longer than the other briefs that Hanes makes.", "review_title": "These are great if you have a small waist", "language": "en", "product_category": "apparel"}
{"review_id": "en_0962261", "product_id": "product_en_0579991", "reviewer_id": "reviewer_en_0470846", "stars": "4", "review_body": "Original equipment replacement. Bit of a pain to install but works well.", "review_title": "As described", "language": "en", "product_category": "automotive"}
{"review_id": "en_0572680", "product_id": "product_en_0230655", "reviewer_id": "reviewer_en_0663290", "stars": "4", "review_body": "The pole is just so so and a bit weak at the joints but still very fun to play with for the price", "review_title": "... a bit weak at the joints but still very fun to play with for the price", "language": "en", "product_category": "drugstore"}
{"review_id": "en_0766961", "product_id": "product_en_0551679", "reviewer_id": "reviewer_en_0396308", "stars": "4", "review_body": "Really nice quality. It fits both me and my friends.", "review_title": "Nice quality", "language": "en", "product_category": "beauty"}
{"review_id": "en_0071779", "product_id": "product_en_0766061", "reviewer_id": "reviewer_en_0870808", "stars": "4", "review_body": "The telescope is good, but the USPS is too slow.", "review_title": "Binoculars are great", "language": "en", "product_category": "camera"}
{"review_id": "en_0764632", "product_id": "product_en_0870840", "reviewer_id": "reviewer_en_0089593", "stars": "4", "review_body": "Product is as described.", "review_title": "product is as described.", "language": "en", "product_category": "pc"}
{"review_id": "en_0240981", "product_id": "product_en_0367466", "reviewer_id": "reviewer_en_0888972", "stars": "4", "review_body": "I put this in my 2014 Ford F150 which the speakers were blown. I was expecting more bass which is mediocre at best. My 2010 ram 1500 has 5 times better bass than these speakers and they dodge is stock sound system. But for the price I guess is decant.", "review_title": "Easy install, clear sound, mediocre bass", "language": "en", "product_category": "wireless"}
{"review_id": "en_0706496", "product_id": "product_en_0390602", "reviewer_id": "reviewer_en_0945719", "stars": "4", "review_body": "This squishy wasn’t too soft or slow rising but it smelled very good. It took about 3-4 seconds to rise.", "review_title": "3-4 second rise but smelled good", "language": "en", "product_category": "toy"}
{"review_id": "en_0095534", "product_id": "product_en_0673082", "reviewer_id": "reviewer_en_0493382", "stars": "4", "review_body": "This stopped working after a 3 week period of use. They refuse to refund the money so buyer beware. I worked great for a short period of time. This really is a failure. After this review I was contacted by the company and they resolved my problem in a timely manner. I now consider the company response very favorably.", "review_title": "acceptable product", "language": "en", "product_category": "electronics"}
{"review_id": "en_0598184", "product_id": "product_en_0399059", "reviewer_id": "reviewer_en_0043793", "stars": "4", "review_body": "Really nice case. The only thing I don't like about it is the back side of the case as it does not wrap up around like my old case and presents a snagging potential. I have not had it happen yet, but it could.", "review_title": "Pretty good.", "language": "en", "product_category": "pc"}
{"review_id": "en_0972870", "product_id": "product_en_0729177", "reviewer_id": "reviewer_en_0283601", "stars": "4", "review_body": "nice set of strings. Didn't fit like I expected a short scale set to fit but I didn't measure them before I cut them to fit without excess. still a good buy.", "review_title": "nice set of strings", "language": "en", "product_category": "musical_instruments"}
{"review_id": "en_0902708", "product_id": "product_en_0590942", "reviewer_id": "reviewer_en_0541695", "stars": "4", "review_body": "I purchased two of these for me and one of my friends to use while camping at a campsite with notoriously gross bathrooms over the summer. They worked well. However, you have to be careful because the funnel part will come off mid-pee if you push it up against you too hard, LOL.", "review_title": "A necessity for camping..", "language": "en", "product_category": "other"}
{"review_id": "en_0807352", "product_id": "product_en_0228407", "reviewer_id": "reviewer_en_0764049", "stars": "4", "review_body": "It has a nice feel and red color stripes. A little shorter then expected; therefore, I hanged dry instead of the dryer. Used the shirt for a pirate outfit.", "review_title": "Nice feel and red color stripes.", "language": "en", "product_category": "apparel"}
{"review_id": "en_0162081", "product_id": "product_en_0779912", "reviewer_id": "reviewer_en_0204767", "stars": "4", "review_body": "I love the phone case , but was quite confused when I opened it and it actually smelled like mint. Had several other people smell it thinking I lost my mind but nope, it actually smells like mint.", "review_title": "I love the phone case", "language": "en", "product_category": "electronics"}
{"review_id": "en_0931423", "product_id": "product_en_0996824", "reviewer_id": "reviewer_en_0040101", "stars": "4", "review_body": "Love the materials and look of the black with red piping seat covers. The fit is pretty good on my 2018 Honda Accord Sport after sitting in them for about a week. The headrest covers are a waste though. Didn’t use them. Needs a little more thought into the design and better coverage. Not a fan of the cheap gold badge near the top of the backrest, either. Manufacturer could save money by eliminating it. Just a few minor suggestions to a nice set of seat covers. 4 stars could be 5 with improvements.", "review_title": "Happy with seat covers", "language": "en", "product_category": "automotive"}
{"review_id": "en_0867022", "product_id": "product_en_0534598", "reviewer_id": "reviewer_en_0524721", "stars": "4", "review_body": "My 8yo daughter's hair is still baby-like, thin and fine and wont curl, but I'm also not all that great with doing hair so maybe it's me. This clip in thing was perfect for her hair! It matched perfectly and it was easy to do. All I did was pull her hair back in a bun and clipped it in. I used a few Bobby pins but it felt secure without it. She was so excited to show off her curly hair at the Daddy Daughter dance at school. She kept it on the whole time which surprised me because she is tender headed. She wore it again for picture day a few weeks later. After wearing it twice it's gotten frizzy and looks a bit messy but by reading other reviews I know to just wash and reset them. I've not done that yet because I want to read more and be sure of what I'm doing first. I will definitely buy more styles of clip ins for her since this worked so well!", "review_title": "Works great for Children's hair", "language": "en", "product_category": "beauty"}
{"review_id": "en_0457416", "product_id": "product_en_0690548", "reviewer_id": "reviewer_en_0704364", "stars": "4", "review_body": "Fun prank works really well", "review_title": "Fun", "language": "en", "product_category": "toy"}
{"review_id": "en_0467227", "product_id": "product_en_0578984", "reviewer_id": "reviewer_en_0206061", "stars": "4", "review_body": "Wonderful for anyone who tends to drop things.", "review_title": "Kitchen items", "language": "en", "product_category": "kitchen"}
{"review_id": "en_0431038", "product_id": "product_en_0327597", "reviewer_id": "reviewer_en_0706702", "stars": "4", "review_body": "I actually didn’t order this for pet use! I’m working on a project for my daughter’s Halloween costume. I’m making her a fox tail and it called for combing yarn with a pet brush and then straightening with a hot iron. This brush is spectacular bc it brings up the tons and tons of yarn remains that would be a headache cleaning up! 2 thumbs up!", "review_title": "Using to make fox tail", "language": "en", "product_category": "pet_products"}
{"review_id": "en_0814472", "product_id": "product_en_0184807", "reviewer_id": "reviewer_en_0089511", "stars": "4", "review_body": "I came in the middle of the series but still enjoyed the story and characters.", "review_title": "An entertaining read", "language": "en", "product_category": "digital_ebook_purchase"}
{"review_id": "en_0930421", "product_id": "product_en_0649928", "reviewer_id": "reviewer_en_0140810", "stars": "4", "review_body": "Scissors are great, pretty nicely built. Only drawback is the magnet thing doesn't hold anything heavy. Barely holds the shears.", "review_title": "Great scissors but so-so magnetic bar.", "language": "en", "product_category": "kitchen"}
{"review_id": "en_0412999", "product_id": "product_en_0697988", "reviewer_id": "reviewer_en_0411261", "stars": "4", "review_body": "This is the first setup of this nature that I've ever purchased. My son wanted to start his own cooking channel on YouTube and we needed something to help us record the video and sound using an old Samsung Galaxy 7. I found this setup quick and to assemble. I took away a few stars on durability because I broke the microphone mount the 2nd time I used it. It was just too rigid to pop the mic in and out. I can still mount the mic which is nice, the mount is just broken in the middle. The case that it comes with is really convenient. I'd recommend this for anyone with a need for a mic and light set.", "review_title": "Great for beginners", "language": "en", "product_category": "electronics"}
{"review_id": "en_0772039", "product_id": "product_en_0995348", "reviewer_id": "reviewer_en_0551162", "stars": "4", "review_body": "Just a reminder that this connector only works one out put at a time. If you're looking to have duel output, you'll need to buy a powered unit that says it can handle that feature. Otherwise, works well.", "review_title": "Works well with one output at a time", "language": "en", "product_category": "electronics"}
{"review_id": "en_0300122", "product_id": "product_en_0514804", "reviewer_id": "reviewer_en_0437200", "stars": "4", "review_body": "My granddaughter loves bath bombs and these were no different. Packaged very well. All of the roses make a circle with a heart saying love in the middle .they fizz in the tub awhile which I like and the smell is very good left her skin feelin soft. A little expensive but most bath bombs are. They were comparable to the bath bombs I have bought at a pricey boutique all in all I was satisfied", "review_title": "All of the roses make a circle with a heart saying love in the middle", "language": "en", "product_category": "beauty"}
{"review_id": "en_0209507", "product_id": "product_en_0585931", "reviewer_id": "reviewer_en_0105622", "stars": "4", "review_body": "All i have to do is pick it up and the dogs know that they need to be quiet.", "review_title": "it works", "language": "en", "product_category": "pet_products"}
{"review_id": "en_0869932", "product_id": "product_en_0564151", "reviewer_id": "reviewer_en_0332994", "stars": "4", "review_body": "This is a pretty decent dvd shelf. It's a bit of a pain to install since it requires several tools. You need a screwdriver and a hammer to fit it together. Also, the shelves aren't wobbly at all, but I believe the included wall mount is required for stabilizing. All in all, this is a fine particle board shelf.", "review_title": "Good for the money. Long install", "language": "en", "product_category": "furniture"}
{"review_id": "en_0391632", "product_id": "product_en_0559548", "reviewer_id": "reviewer_en_0470770", "stars": "4", "review_body": "12/2 Update: After using this laptop bag for a couple of months the velco that holds the laptop in the laptop sleeve has come apart. I still love my bag. Thankfully it has a zipper closure. I love everything about this bag. How it hangs on my shoulder. How it fits my laptop and other items. It is just perfect. It came beautiful packaged! Kudos to the seller!", "review_title": "Wow! Beautiful Laptop Bag!", "language": "en", "product_category": "pc"}
{"review_id": "en_0684740", "product_id": "product_en_0976767", "reviewer_id": "reviewer_en_0539639", "stars": "4", "review_body": "It's been about a month since I have put it on my new phone. It's very pretty, design has not yet scratched off or fallen off; the clear material has NOT yellowed, and i like how it feels. It's very good quality and well worth the money. It comes with a phone stand that I dont really use but I do like it when I have used it. Good buy!", "review_title": "It's very pretty, design has not yet scratched off or fallen ...", "language": "en", "product_category": "wireless"}
{"review_id": "en_0641906", "product_id": "product_en_0864317", "reviewer_id": "reviewer_en_0094120", "stars": "4", "review_body": "Good band for the money. Looks good but a little cheap in quality", "review_title": "Not bad", "language": "en", "product_category": "sports"}
{"review_id": "en_0737481", "product_id": "product_en_0415491", "reviewer_id": "reviewer_en_0148502", "stars": "4", "review_body": "I loved the idea of this... But now that I have it, I'm kind of disappointed, it's closed up in a way that if your gecko (or other reptile) is in it, you can't access the animal... This is great for feeling secure, but if you need to take your animal out for any reason, you'll have to take the whole hide out and hope the gecko comes out in a timely manner... Other then that, I like the design and size, it's bigger then expected", "review_title": "Could have been made with the pet parent in mind", "language": "en", "product_category": "pet_products"}
{"review_id": "en_0087353", "product_id": "product_en_0584546", "reviewer_id": "reviewer_en_0785642", "stars": "4", "review_body": "Works great directions not too clear but we figured it out!", "review_title": "Works fine", "language": "en", "product_category": "other"}
{"review_id": "en_0948519", "product_id": "product_en_0001043", "reviewer_id": "reviewer_en_0528716", "stars": "4", "review_body": "Someone recommended that I look at this sleeping pad after the one I was using developed a leak. I was a little apprehensive about all the claims but this pad fits the bill. It is lighter and rolls to a smaller size than my previous sleeping pad. It also inflates faster which is great after a long hike. The only reason I didn't give it all five stars is it is not as thick as I would like. It is still very comfortable but I could use a little more support in my lower back. I solve this problem by putting a rolled up T-shirt where I need it. This may only be my problem and it will not stop me from using this pad on future camping trips.", "review_title": "Light weight and comfortable", "language": "en", "product_category": "other"}
